{"com.mola.playspace.android.domino.permission.PAYMENT_BROADCAST": 9723, "com.psd2filters.glitchart.permission.C2D_MESSAGE": 11200, "com.hidating.hidatingapp.permission.C2D_MESSAGE": 7253, "com.pereira.live.permission.C2D_MESSAGE": 10867, "in.adityaanand.gre.permission.C2D_MESSAGE": 15264, "com.minhdafpt.com.vn.sendoseller.permission.C2D_MESSAGE": 9377, "com.altermyth.bima.tablet.permission.C2D_MESSAGE": 2382, ".permission.A4S_SEND": 3, "com.autonetmobile.dealerconnect.permission.C2D_MESSAGE": 3368, "com.facebook.android.permission.C2D_MESSAGE": 5713, "android.Manifest.permission.FORCE_STOP_PACKAGES": 270, "com.mobilizeit.ossbss2016.permission.C2D_MESSAGE": 9547, "com.quvideo.xiaoying.permission.C2D_MESSAGE": 11332, "com.phonecastsolutions.bzreisadvies.permission.MAPS_RECEIVE": 10901, "com.nanoequipment.lightning.permission.MAPS_RECEIVE": 9993, "net.xnano.android.changemymac.permission.C2D_MESSAGE": 16245, "com.adnet.getinvolved.permission.C2D_MESSAGE": 2165, "android.permission.ACCESS_LOCATTON_MOCK_LOCATION": 451, "android.permission.BIND_INPUT_METHOD": 520, "com.iphonedroid.expansion.permission.C2D_MESSAGE": 7916, "com.aff.randijoy.permission.C2D_MESSAGE": 2207, "org.cosinus.aviatool.permission.C2D_MESSAGE": 16367, "com.claroBrasil.contenedor.permission.UA_DATA": 4361, "armando_32.permission.C2D_MESSAGE": 1196, "com.blacklight.klondike.patience.solitaire.permission.C2D_MESSAGE": 3858, "com.zikosdev.girly.permission.C2D_MESSAGE": 14345, "com.perk.livetv.aphone.permission.C2D_MESSAGE": 10875, "com.allinoneremote.permission.C2D_MESSAGE": 2357, "tv.shou.android.permission.C2D_MESSAGE": 17013, "com.cv.cds.library.permission.C2D_MESSAGE": 4770, "com.karaoke.login.permission.C2D_MESSAGE": 8279, "com.delitestudio.filetransferfree.permission.C2D_MESSAGE": 4902, "com.taplane.logoquiz.permission.C2D_MESSAGE": 12742, "com.cybermind.google.famecelebritystory.permission.C2D_MESSAGE": 4785, "bankers.addahindi.permission.C2D_MESSAGE": 1332, "com.android.droidapps.permission.C2D_MESSAGE": 2512, "com.fhxserver.ultimate.permission.C2D_MESSAGE": 5836, "epson.print.permission.C2D_MESSAGE": 14751, "es.socialpoint.hydra.permissions.PermissionsActivity": 14775, "com.resultsclue.timetable12th.permission.C2D_MESSAGE": 11502, "com.novel.reader.pushnotification.permission.C2D_MESSAGE": 10381, "android.permission.SENSOR_INFO": 890, "com.ants.wip.permission.C2D_MESSAGE": 2702, "com.qq.AppService.permission.out.CACHE_READ_PERMISSION": 11275, "com.seal.permissions.services.ADDONS": 11847, "com.directv.navigator.permission.UA_DATA": 5051, "com.hp.android.printservice.permission.C2D_MESSAGE": 7372, "jp.naver.line.android.permission.C2D_MESSAGE": 15572, "com.wLiveSport_3874729.permission.C2D_MESSAGE": 13820, "nichetech.malayalam.editor.permission.C2D_MESSAGE": 16262, "com.baniyadeals.baniyadeals.permission.C2D_MESSAGE": 3540, "au.com.homeloveapp.permission.C2D_MESSAGE": 1272, "com.sports.schedules.basketball.nba.permission.C2D_MESSAGE": 12465, "com.amazon.dcp.sso.permission.CUSTOMER_ATTRIBUTE_SERVICE": 2407, "com.qihoo360.screenlock.permission.READ_LOCAL_THEME": 11257, "com.transsion.phoenix.permission.READ_HOMEPAGE": 13252, "com.bolavip.permission.C2D_MESSAGE": 3914, "android.permission.REQUEST_INSTALL_PACKAGES": 859, "com.Settings.widget.permission.SettingsAppWidgetProvider": 2004, "com.sanaedutech.tnpsc.permission.C2D_MESSAGE": 11760, "com.netatmo.camera.permission.C2D_MESSAGE": 10112, "fr.meilleurlogiciel.holyquranpro.permission.C2D_MESSAGE": 14895, "org.mcapp.app56bf7cea40703.permission.C2D_MESSAGE": 16413, "com.coccoc.trinhduyet.permission.READ_WRITE_BOOKMARK_FOLDERS": 4419, "com.smart.control.ipanel.permission.C2D_MESSAGE": 12227, "com.birdcash.permission.C2D_MESSAGE": 3778, "com.example.makani.permission.MAPS_RECEIVE": 5649, "com.auer.pushnotification.permission.C2D_MESSAGE": 3339, "com.rvappstudios.fingerslayer.permission.C2D_MESSAGE": 11642, "com.gingersoftware.android.keyboard.permission.C2D_MESSAGE": 6512, "com.treemolabs.apps.cnet.permission.C2D_MESSAGE": 13262, "com.kaazzaan.airpanopanorama.permission.MAPS_RECEIVE": 8244, "com.tecarta.OnceADay.permission.C2D_MESSAGE": 12805, "com.gettogether.permission.C2D_MESSAGE": 6496, "com.mylocaltv.kptvdroid.permission.C2D_MESSAGE": 9925, "com.reticode.lovemessages.permission.C2D_MESSAGE": 11508, "com.solodroid.materialwallpaper.permission.C2D_MESSAGE": 12332, "kidgames.christmas.pack.permission.C2D_MESSAGE": 15634, "com.shop.ini.permission.C2D_MESSAGE": 12069, "com.bigfans.crreminder.permission.C2D_MESSAGE": 3743, "com.doapps.android.mln.MLN_e4c7991c840bd4665a1f9c72441b069c.permission.C2D_MESSAGE": 5121, "com.pikpok.mm.play.permission.C2D_MESSAGE": 10928, "org.opengapps.app.permission.C2D_MESSAGE": 16431, "com.zing.zalo.permission.BIND_ZALO_SERVICE": 14353, "se.scmv.morocco.permission.C2D_MESSAGE": 16816, "com.scanapps.moodscanner3.permission.C2D_MESSAGE": 11815, "com.tentkls.Wreath.permission.C2D_MESSAGE": 12951, "android.permission.GET_CLIPS": 637, "com.newssynergy.pahomepageweather.permission.C2D_MESSAGE": 10183, "com.sirmamobile.prodavalnik.permission.C2D_MESSAGE": 12143, "android.permission.INSTALL_GRANT_RUNTIME_PERMISSIONS": 661, "jp.digitallab.raideengroup.permission.C2D_MESSAGE": 15542, "com.xiaomi.sdk.permission.PAYMENT": 14144, "com.urbanairship.push.sample.permission.RECEIVE_ADM_MESSAGE": 13481, "com.eyemakeuptipstamil.eyemakeupideas.permission.C2D_MESSAGE": 5695, "com.ileadgame.arabempire.permission.C2D_MESSAGE": 7725, "me.doubledutch.tcecsummer.permission.C2D_MESSAGE": 15817, "com.don.offers.permission.C2D_MESSAGE": 5165, "com.freegame.bingo.permission.C2D_MESSAGE": 6078, "android.permission.CHANGE_NETWORK_STATE": 576, "android.permission.ACCESS_COARSE": 426, "com.getfitsofia.permission.C2D_MESSAGE": 6488, "com.alawar.wbzgauwbzha.permission.C2D_MESSAGE": 2313, "com.kamusegames.fishingtour.permission.C2D_MESSAGE": 8275, "com.vbox7.permission.C2D_MESSAGE": 13522, "com.mtsgames.cargotrainssimulator.permission.C2D_MESSAGE": 9835, "com.ultimategamestudio.mcpecenter.seeds.gcm.permission.C2D_MESSAGE": 13433, "de.saturn.clockshopwidget.permission.C2D_MESSAGE": 14636, "com.dreamstep.wFetVancouver.permission.C2D_MESSAGE": 5224, "net.fussballtransfers.mobile.permission.C2D_MESSAGE": 16108, "com.DigitGaming.kotrqa.permission.UA_DATA": 1882, "com.conduit.app_65e625e89479481ca3dd11d32aba3f7c.app.permission.RECEIVE_ADM_MESSAGE": 4565, "com.el.empregoligado.permission.C2D_MESSAGE": 5426, "com.shoujiduoduo.ringtone.permission.MIPUSH_RECEIVE": 12093, "air.fire.game.zombiewar.dead.clashking.permission.C2D_MESSAGE": 206, "com.alfacart.alfamikroapp.permission.C2D_MESSAGE": 2326, "com.blablaapp.launcher.permission.C2D_MESSAGE": 3818, "android.permission.NET_CANBUS": 735, "com.qihoo.antivirus.update.permission.clear_sdk_lds": 11238, "android.permission.ACCESS_FIND_LOCATION": 438, "com.kilogames.subwayserferchg.permission.C2D_MESSAGE": 8389, "com.WhatWapp.BuracoOnlineBR.permission.C2D_MESSAGE": 2033, "es.mmip.prisacom.as.permission.RECEIVE_ADM_MESSAGE": 14768, "xyz.livenettv.stream.permission.C2D_MESSAGE": 17218, "com.minecrfattutorial.diego.minecraftbuildinghouse.permission.C2D_MESSAGE": 9367, "gr.vanderbox.guythegnetwork.permission.C2D_MESSAGE": 15110, "com.umonistudio.tile.permission.AIDL_SERVICE": 13445, "com.app.p1180DJ.permission.C2D_MESSAGE": 2808, "com.wastech.social.permission.C2D_MESSAGE": 13878, "com.google.android.c2dm.permission.RECEIVE": 6769, "br.com.rodrigokolb.congasandbongosfree.permission.C2D_MESSAGE": 1534, "com.android.alarm.permission.GET_ALARM": 2491, "com.ss.android.essay.joke.permission.MIPUSH_RECEIVE": 12500, "ro.mercador.permission.C2D_MESSAGE": 16669, "com.membertek.otg.permission.C2D_MESSAGE": 9247, "com.google.android.gms.trustagent.permission.TRUSTAGENT_STATE": 6833, "getui.permission.GetuiService.com.allfootball.news": 14993, "com.footlocker.canada.permission.BEACON_RESULT_RECEIVE": 5981, "com.planoly.android.permission.C2D_MESSAGE": 10991, "com.freedomltd.FreedomApp.permission.C2D_MESSAGE": 6065, "com.shrtech.cellphonetricks.permission.C2D_MESSAGE": 12100, "com.andropenoffice.permission.EXTENSIONS": 2640, "com.yamaha.jp.dataviewer.permission.MAPS_RECEIVE": 14212, "com.raytechnos.marathidictionary.permission.C2D_MESSAGE": 11416, "android.permission.USER_PRESENT": 949, "binaryearth.handyunits.permission.C2D_MESSAGE": 1379, "com.appeteria.battery100alarm.permission.C2D_MESSAGE": 3016, "it.spazioit.melonicalzature.permission.C2D_MESSAGE": 15437, "com.asos.app.permission.C2D_MESSAGE": 3267, "com.baidu.launcher.i18n.permission.RECEIVE_LAUNCH_BROADCASTS": 3482, "fr.sopheos.loto.permission.MAPS_RECEIVE": 14907, "com.bayer.bcs.farmingsfuture.permission.C2D_MESSAGE": 3572, "de.is24.hausbauphone.permission.C2D_MESSAGE": 14580, "prod.lemondev.gralpy.permission.C2D_MESSAGE": 16598, "android.permission.android.permission.MANAGE_ACCOUNTS": 1035, "com.disney.disneyrestaurant_goo.permission.C2D_MESSAGE": 5064, "net.edarling.mobile.permission.C2D_MESSAGE": 16089, "com.chic.ledstrobo.permission.C2D_MESSAGE": 4278, "ag.sportradar.android.livescore.base.permission.C2D_MESSAGE": 42, "lri.game.blox.permission.C2D_MESSAGE": 15759, "com.abtnprojects.ambatana.permission.C2D_MESSAGE": 2096, "com.blacklight.spidersolitaire.gcm.permission.C2D_MESSAGE": 3859, "mobi.SyndicateApps.ICS.launcher.permission.WRITE_SETTINGS": 15879, "com.app_cimaapp.layout.permission.C2D_MESSAGE": 2889, "com.nhn.android.nbooks.permission.C2D_MESSAGE": 10237, "com.freeinternet1.permission.C2D_MESSAGE": 6080, "com.nWeave.AppleADay.permission.C2D_MESSAGE": 9968, "ro.mercador.permission.UA_DATA": 16671, "call.free.international.callvibes.permission.C2D_MESSAGE": 1654, "com.wtvg.abc13radar.permission.MAPS_RECEIVE": 14095, "gbis.gbandroid.permission.C2D_MESSAGE": 14978, "the.pdfviewer3.permission.C2D_MESSAGE": 16939, "air.com.neon.games.WBT.permission.C2D_MESSAGE": 150, "com.mhapps.feen.permission.MAPS_RECEIVE": 9303, "com.longtech.lastwars.gp.permission.C2D_MESSAGE": 8864, "com.gz.zeitgeist.permission.C2D_MESSAGE": 7106, "com.rovio.angrybirdsseasons.permission.C2D_MESSAGE": 11598, "com.bikroy.permission.LAYER_PUSH": 3765, "com.careerjet.android.permission.C2D_MESSAGE": 4116, "com.smartfren.permission.MAPS_RECEIVE": 12235, "com.opera.max.permission.GET_MIGRATION_DATA": 10632, "com.bobby.carrothd.permission.C2D_MESSAGE": 3908, "com.elevenst.permission.C2D_MESSAGE": 5440, "android.permission.CAM": 555, "com.irac.irac.permission.C2D_MESSAGE": 7926, "com.trendmicro.dr.booster.permission.C2D_MESSAGE": 13268, "com.deway.ampla.permission.C2D_MESSAGE": 4970, "knk.music.KingSoftOfficer.shortcuts.permission.C2D_MESSAGE": 15660, "com.iart.chromecastapps.permission.C2D_MESSAGE": 7610, "com.chan.vuong.chanpro.permission.C2D_MESSAGE": 4211, "android.permission.HUAWEI_SYSTEM_NODE_ACCESS": 655, "com.ulmon.android.citymaps2go.permission.C2D_MESSAGE": 13419, "android.permission.RESET_BATTERY_STATS": 860, "kewi.mobi.nhc2016.permission.MAPS_RECEIVE": 15629, "android.permission.BIND_REMOTEVIEWS": 524, "android.permission.RECEIVE_USER_PRESENT": 846, "ba.pik.v2.android.permission.C2D_MESSAGE": 1311, "com.mbolotener.gamingapp.permission.C2D_MESSAGE": 9133, "com.vixlet.mlb.permission.RECEIVE_ADM_MESSAGE": 13623, "com.nekki.shadowfight.permission.C2D_MESSAGE": 10086, "com.sec.android.app.twlauncher.permission.READ_SETTINGS": 11890, "android.hardware.sip.voip": 375, "com.bambo.soccerfight.permission.C2D_MESSAGE": 3516, "com.salmansaleh.cartheftprotection.permission.MAPS_RECEIVE": 11669, "nl.ncrv.eentegen100.permission.C2D_MESSAGE": 16284, "android.permission.BROADCAST_PACKAGE_REPLACED": 542, "com.garena.game.jetvn.permission.C2D_MESSAGE": 6417, "com.wmosafr.permission.C2D_MESSAGE": 14043, "uk.gov.metoffice.android.permission.C2D_MESSAGE": 17064, "com.boyaa.catur.permission.C2D_MESSAGE": 3953, "hotspotshield.android.vpn.permission.C2D_MESSAGE": 15168, "org.freecoder.permission.OVERCLOCK_ACTIVITY": 16386, "com.wFindMeAnywhereLive.permission.C2D_MESSAGE": 13785, "air.AngryRedButtonAndroid.permission.C2D_MESSAGE": 47, "com.conduit.app_ad3b1ff51c394859b440bdc580086caf.app.permission.RECEIVE_ADM_MESSAGE": 4609, "com.taxi123Customer.permission.C2D_MESSAGE": 12766, "org.chromium.chrome.permission.C2D_MESSAGE": 16362, "com.liked.wow.permission.C2D_MESSAGE": 8745, "com.google.cloud.backend.permission.C2D_MESSAGE": 6915, "com.libiitech.candybeautysalon.permission.C2D_MESSAGE": 8715, "com.superluckycasino.doubleup.slots.vegas.android.free.permission.C2D_MESSAGE": 12624, "com.huawei.android.launcher.permission.READ_SETTINGS": 7517, "lequipe.fr.permission.C2D_MESSAGE": 15734, "com.aryservices.aryud.permission.C2D_MESSAGE": 3240, "jp.co.excite.amiple.permission.C2D_MESSAGE": 15501, "com.dcrs.permission.JPUSH_MESSAGE": 4868, "com.mangguotv.aaa.www.permission.JPUSH_MESSAGE": 9029, "tr.atv.permission.C2D_MESSAGE": 16969, "com.premiumsoftware.animalsoundsandphotos.permission.C2D_MESSAGE": 11136, "com.digitalfrog.funmatgoG2.permission.C2D_MESSAGE": 5032, "it.sephora.sephoraitaly.permission.A4S_SEND": 15430, "net.rention.appointmentsplanner.permission.C2D_MESSAGE": 16219, "open.menthal.permission.MAPS_RECEIVE": 16328, "com.widefide.facebookapp.permission.C2D_MESSAGE": 13999, "com.mobilizeit.meetapp3.valmet.permission.C2D_MESSAGE": 9543, "telhadopao_468.permission.C2D_MESSAGE": 16932, "com.android.hipstore.gcm.permission.C2D_MESSAGE": 2522, "com.myntra.android.permission.C2D_MESSAGE": 9939, "com.htc.camera2.permission.GET_STATE": 7407, "com.c51.permission.C2D_MESSAGE": 4065, "com.twobrothers.kids_numbers_and_english_alphabets_learning.permission.C2D_MESSAGE": 13371, "com.tencent.mtt.base.stat.permission.WRITE_STATDB": 12906, "nz.co.vodafone.android.myaccount.permission.MAPS_RECEIVE": 16310, "com.weather.Weather.permission.C2D_MESSAGE": 13911, "com.game.mobile.atxionline.permission.C2D_MESSAGE": 6289, "adu1.affairs.permission.C2D_MESSAGE": 30, "android.permission.NETWORK_STATE": 732, "com.lalafo.permission.C2D_MESSAGE": 8597, "cz.mobilesoft.callblock.permission.C2D_MESSAGE": 14470, "hero.browser4g.internet.permission.C2D_MESSAGE": 15141, "nu.device.id.permission.C2D_MESSAGE": 16303, "hr.apps.n206958722.permission.C2D_MESSAGE": 15178, "android.hardware.audio.low_latency": 298, "com.pockybop.sociali.permission.C2D_MESSAGE": 11086, "com.thunderst.launcher.permission.READ_SETTINGS": 13052, "com.userstorylab.onefifty.gcm.permission.C2D_MESSAGE": 13493, "de.rtl.video.permission.C2D_MESSAGE": 14633, "com.anuntis.fotocasa.permission.C2D_MESSAGE": 2705, "com.app.android.permission.C2D_MESSAGE": 2750, "com.cztraffic.activity.permission.JPUSH_MESSAGE": 4801, "com.bigleapstudios.bigmall.permission.C2D_MESSAGE": 3749, "com.yesup.mobiproxy.permission.C2D_MESSAGE": 14227, "com.duosecurity.duomobile.permission.C2D_MESSAGE": 5298, "com.widdit.lockScreen.permission.C2D_MESSAGE": 13998, "com.bamnetworks.mobile.android.ballpark.permission.C2D_MESSAGE": 3521, "com.mobincube.android.sc_3AFXSF.permission.C2D_MESSAGE": 9576, "com.tani.eren1.permission.C2D_MESSAGE": 12722, "com.ivms.hw.HD.permission.C2D_MESSAGE": 7990, "com.quizup.core.google.gcm.permission.C2D_MESSAGE": 11320, "com.jerichogames.hidden.permission.C2D_MESSAGE": 8069, "com.codetree.rmc.permission.C2D_MESSAGE": 4448, "de.aldiNord.android.permission.C2D_MESSAGE": 14511, "re.touchwa.navimeteo.permission.C2D_MESSAGE": 16641, "com.b2w.americanas.permission.C2D_MESSAGE": 3447, "net.casinuevo.appweb.permission.C2D_MESSAGE": 16063, "com.shop.android.permission.C2D_MESSAGE": 12068, "android.permission.Internet": 674, "com.zynga.cityvillemobile.permission.C2D_MESSAGE": 14422, "com.playtika.dice.legends.permission.C2D_MESSAGE": 11033, "fr.nghs.android.miser.permission.C2D_MESSAGE": 14902, "bbc.mobile.news.ww.permission.C2D_MESSAGE": 1336, "com.qiuandei.babytips.permission.token_content_provider": 11265, "fp.adobe.mint_16_55_push.permission.C2D_MESSAGE": 14854, "ru.lextre.matissa.permission.C2D_MESSAGE": 16722, "com.taplane.triviaquiz.permission.C2D_MESSAGE": 12744, "com.kaskus.chat.permission.C2D_MESSAGE": 8287, "com.mxxcid.fun.sea.permission.C2D_MESSAGE": 9881, "com.groomefy.permission.C2D_MESSAGE": 7019, "net.elvista.kozel.permission.C2D_MESSAGE": 16093, "com.androidapptech.passwordmanager.permission.C2D_MESSAGE": 2618, "com.whatsapp.permission.VOIP_CALL": 13976, "com.app_communicationconnection.layout.permission.C2D_MESSAGE": 2893, "com.sgn.geniesandgems.gp.permission.C2D_MESSAGE": 12020, "com.sharpshark.ageofwar.permission.C2D_MESSAGE": 12036, "com.thomsonreuters.convene.knox.permission.C2D_MESSAGE": 13042, "de.crea.musikparkdresden.permission.C2D_MESSAGE": 14542, "de.is24.android.permission.C2D_MESSAGE": 14579, "com.mathrawk.calleridfaker.permission.C2D_MESSAGE": 9108, "com.citrix.iflag.permission.C2D_MESSAGE": 4337, "com.emediashopgr.androidstore.permission.C2D_MESSAGE": 5462, "br.com.dafiti.permission.A4S_SEND": 1484, "com.goldengekko.edsa.herold.permission.C2D_MESSAGE": 6662, "com.mobisystems.msdict.embedded.wireless.oxford.concisemedical.permission.C2D_MESSAGE": 9665, "com.ads.asiandatingsocial.permission.C2D_MESSAGE": 2181, "ghost.hack.mod.for.minecraft.pe.emobileapp.permission.C2D_MESSAGE": 15080, "com.freeforallsoft.javavideotutorials.permission.C2D_MESSAGE": 6075, "com.xlr.bukd.permission.C2D_MESSAGE": 14179, "hr.apps.n150274672.permission.C2D_MESSAGE": 15170, "com.bonfiremedia.launcher.permission.C2D_MESSAGE": 3918, "com.applicando.applicandofood.permission.C2D_MESSAGE": 3038, "com.NNGames.sultan.permission.C2D_MESSAGE": 1967, "air.com.sgn.cookiejam.gp.permission.C2D_MESSAGE": 167, "com.India.Independencedaylivewallpaper.permission.C2D_MESSAGE": 1928, "br.com.claroespanhol.permission.BIND_SYNC_SERVICE": 1478, "com.esealed.dalily.permission.C2D_MESSAGE": 5533, "air.com.hoiquan52.choibaionline.permission.C2D_MESSAGE": 128, "com.jappka.bataria.permission.C2D_MESSAGE": 8028, "vn.harrisaustin.DotBattle.permission.C2D_MESSAGE": 17126, "de.bayernwerk_natur.impulskw.permission.C2D_MESSAGE": 14530, "com.nerdyoctopus.gamedots.permission.C2D_MESSAGE": 10104, "com.akashinfotech.mypcclub.permission.C2D_MESSAGE": 2300, "com.cars.quickoffers.dealers.permission.MAPS_RECEIVE": 4132, "com.aladinfun.crazyplanets.permission.C2D_MESSAGE": 2306, "com.ice9apps.robistorelocator.permission.C2D_MESSAGE": 7636, "uk.co.very.myvery.permission.RECEIVE_ADM_MESSAGE": 17058, "com.apps.adrcotfas.goodtime.permission.C2D_MESSAGE": 3078, "com.papumba.android.learnenglish.permission.C2D_MESSAGE": 10780, "com.com2us.smon.normal.freefull.google.kr.android.common.permission.C2D_MESSAGE": 4479, "nz.co.vodafone.android.myaccount.permission.C2D_MESSAGE": 16309, "com.diarioas.guialigas.permission.UA_DATA": 5012, "com.aniways.anigram.messenger.permission.C2D_MESSAGE": 2679, "com.Dean.launcher.permission.READ_SETTINGS": 1877, "com.amazon.android.permission.DOWNLOAD_WITHOUT_NOTIFICATION": 2394, "com.jrustonapps.myauroraforecast.permission.C2D_MESSAGE": 8180, "com.bitstrips.imoji.permission.C2D_MESSAGE": 3805, "android.hardware.Camera": 287, "com.fsecure.ms.dc.browser.permission.WRITE_HISTORY_BOOKMARKS": 6130, "com.huawei.android.internal.app.permission.WRITE_SETTINGS": 7514, "com.wq.stone.permission.JPUSH_MESSAGE": 14077, "com.aufeminin.beautiful.permission.MAPS_RECEIVE": 3341, "com.worldarcades.checkersbattler.permission.C2D_MESSAGE": 14071, "com.nokia.homescreen.permission.FASTLANE": 10338, "com.pft.starsports.ui.permission.UA_DATA": 10882, "com.firstdate.shadikiraat.permission.C2D_MESSAGE": 5864, "com.moonraft.tvsbuddy.locate.permission.MAPS_RECEIVE": 9746, "in.encashea.encasheaapp.permission.C2D_MESSAGE": 15287, "com.andysi.freevideochatonline.permission.C2D_MESSAGE": 2647, "com.devgame.fixiesfactory.permission.C2D_MESSAGE": 4959, "com.ea.fifaultimate_na.permission.C2D_MESSAGE": 5321, "android.permission.REMOVE_PACKAGES": 855, "com.gameonline.billiardtourpro.permission.C2D_MESSAGE": 6354, "com.omarapps.gardenswallpapers.permission.C2D_MESSAGE": 10539, "com.lookout.enterprise.permission.C2D_MESSAGE": 8867, "com.enrasoft.keepcalm.permission.C2D_MESSAGE": 5490, "com.ifeng.news2.permission.MMOAUTH_CALLBACK": 7675, "br.com.hotelurbano.permission.C2D_MESSAGE": 1495, "com.rfi.sams.android.permission.UA_DATA": 11522, "com.projectslender.permission.C2D_MESSAGE": 11184, "com.acmhacettepe.permission.C2D_MESSAGE": 2131, "com.money.cashapp.permission.C2D_MESSAGE": 9730, "com.wJuegodeBurbujasMariposas5.permission.C2D_MESSAGE": 13812, "mathrubhumi.calendar2017.permission.C2D_MESSAGE": 15795, "com.yoka.hotman.permission.JPUSH_MESSAGE": 14245, "com.dbd.pdfcreator.permission.C2D_MESSAGE": 4865, "com.guobi.winguo.hybrid.permission.READ_SETTINGS": 7076, "uk.co.volkswagen.myvw.permission.RECEIVE_ADM_MESSAGE": 17061, "com.zappoint.zappoint.permission.CORRECTION": 14301, "my.com.maxis.hotlink.permission.C2D_MESSAGE": 16018, "com.amazon.cast.mega.permission.C2D_MESSAGE": 2399, "mobi.infolife.ezweather.widget.albatross.permission.C2D_MESSAGE": 15900, "com.samsung.android.hostmanager.permission.READ_APP_REGISTRY": 11702, "am.ggtaxi.main.permission.MAPS_RECEIVE": 250, "com.hasbro.catchphrase.app.permission.C2D_MESSAGE": 7170, "com.searchonepeople.permission.C2D_MESSAGE": 11850, "com.fourtaps.libpro.permission.C2D_MESSAGE": 6025, "com.amazon.appmanager.preload.permission.READ_PRELOAD_APP_INFO_PROVIDER": 2396, "com.fakegps.location.go.permission.C2D_MESSAGE": 5753, "com.mocion.alistacar.permission.PushHandlerActivity": 9697, "com.google.android.c2dm.permission.REGISTRATION": 6772, "com.cometdocs.pdftoexcel.permission.C2D_MESSAGE": 4484, "com.mona.bettingtipsgr.permission.C2D_MESSAGE": 9727, "com.innospark.lgherosky.permission.C2D_MESSAGE": 7817, "com.fexyapps.quranmp3.permission.C2D_MESSAGE": 5826, "com.bluebyteapps.sporttips.permission.C2D_MESSAGE": 3886, "com.srs.shareaflash.permission.C2D_MESSAGE": 12497, "com.keerby.downloadaccelerator.permission.C2D_MESSAGE": 8338, "com.tinjasoft.tasks.permission.READ_TASKS": 13100, "com.studio8fa.adsense.permission.C2D_MESSAGE": 12573, "com.airasia.mobile.gcm.permission.C2D_MESSAGE": 2243, "com.narvii.amino.x99817505.permission.C2D_MESSAGE": 10024, "com.narvii.amino.x138543080.permission.C2D_MESSAGE": 10004, "mobi.mgeek.TunnyBrowser.permission.C2D_MESSAGE": 15944, "com.efamilynet.chat.permission.C2D_MESSAGE": 5405, "com.hill.socialliker.permission.C2D_MESSAGE": 7274, "kb2.soft.fuelmanager.permission.C2D_MESSAGE": 15622, "com.kartel.chargerpay.permission.C2D_MESSAGE": 8285, "com.appasia.theamazingwheel.permission.C2D_MESSAGE": 3001, "com.storm8studios.citynext.permission.C2D_MESSAGE": 12547, "htc.socialmanager.permission.USE_SOCIALSERVICE": 15195, "com.amazon.reinvent.permission.RECEIVE_ADM_MESSAGE": 2435, "android.permission.ACCESS_COURSE_LOCATION": 432, "networld.jetso.app.permission.C2D_MESSAGE": 16252, "com.airjordannikerelease.permission.C2D_MESSAGE": 2258, "madagascar.circus.permission.C2D_MESSAGE": 15781, "com.degrees.amtekaboma.r6.permission.C2D_MESSAGE": 4891, "empowr.android.permission.C2D_MESSAGE": 14741, "com.digitalturbine.iqsearch.push.permission.C2D_MESSAGE": 5039, "cineplaza_159.permission.C2D_MESSAGE": 1731, "com.girnarsoft.bikedekho.permission.C2D_MESSAGE": 6532, "com.hugogames.hugotrollrace.permission.C2D_MESSAGE": 7569, "com.IguazuGames.Puzzle.permission.C2D_MESSAGE": 1925, "com.paperlit.android.operanews.permission.C2D_MESSAGE": 10777, "com.foranj.farmtown2.permission.RECEIVE": 5992, "com.wBubbleBalloonShooter.permission.C2D_MESSAGE": 13738, "woden.combate.permission.C2D_MESSAGE": 17170, "com.conduit.app_61e53d3d43284f8ab76a83bdacf2d187.app.permission.MAPS_RECEIVE": 4558, "android.permission.STATUS_BAR": 918, "com.adotis.packking.permission.C2D_MESSAGE": 2178, "com.conduit.app_9b66f563bc1f4f38b2e2307f32166803.app.permission.MAPS_RECEIVE": 4598, "com.idl.giftcloud.permission.C2D_MESSAGE": 7664, "gli.gameramadhan.lawansetan.permission.C2D_MESSAGE": 15088, "com.huawei.camera.permission.BACKUP_PROVIDER": 7532, "it.panini.panadit.permission.C2D_MESSAGE": 15422, "com.surasak.arabickeyboardfreedownload131503.permission.C2D_MESSAGE": 12639, "net.fichajes.mobile.permission.C2D_MESSAGE": 16098, "com.khaleef.CricWick.permission.C2D_MESSAGE": 8365, "com.mylikes.likes.permission.C2D_MESSAGE": 9917, "com.first75.checkers2.permission.C2D_MESSAGE": 5862, "com.mingle.DanceBattle.permission.C2D_MESSAGE": 9371, "com.yulong3.android.launcher.permission.WRITE_SETTINGS": 14283, "com.sec.spp.permission.PUSH_SERVICE_PROVIDER": 11946, "vn.danhbai.tienlenvietnam.permission.C2D_MESSAGE": 17115, "org.x90live.mu.permission.C2D_MESSAGE": 16477, "pl.wyborcza.android.google.permission.C2D_MESSAGE": 16580, "com.sembozdemir.renstagram.permission.C2D_MESSAGE": 11972, "com.devzapps.fastbook.permission.C2D_MESSAGE": 4969, "com.huawei.android.internal.app.permission.READ_SETTINGS": 7513, "com.pulselive.bcci.android.permission.C2D_MESSAGE": 11208, "com.prime31.Etcetera.permission.C2D_MESSAGE": 11149, "org.vadel.mangawatchman.full.permission.C2D_MESSAGE": 16460, "curso.electricidad.permission.C2D_MESSAGE": 14462, "ch.denner.permission.C2D_MESSAGE": 1693, "com.huawei.launcher2.permission.READ_SETTINGS": 7546, "mobi.infolife.ezweather.widget.allo.permission.C2D_MESSAGE": 15902, "com.narvii.amino.x250794481.permission.C2D_MESSAGE": 10014, "com.corinthian.thirteencoins.permission.RECEIVE_ADM_MESSAGE": 4672, "com.deliveryclub.permission.C2D_MESSAGE": 4905, "com.bonial.kaufda.permission.C2D_MESSAGE": 3923, "pl.nubsoft.carpatrol.permission.C2D_MESSAGE": 16559, "asus.permission.INTERACT_ACROSS_USERS": 1221, "com.corprewardz.permission.C2D_MESSAGE": 4681, "com.becoquin.permission.C2D_MESSAGE": 3610, "com.resilio.sync.permission.C2D_MESSAGE": 11496, "com.disney.frozenletitroll_goo.permission.C2D_MESSAGE": 5071, "com.evogames.trump.permission.C2D_MESSAGE": 5631, "com.garena.game.kgtw.permission.C2D_MESSAGE": 6419, "com.gameindy.dummyth.permission.C2D_MESSAGE": 6332, "org.francais.irremote.permission.C2D_MESSAGE": 16381, "com.dodock.footylight.android.permission.C2D_MESSAGE": 5136, "com.wExecutiveRomance.permission.C2D_MESSAGE": 13780, "com.callscreen.hd.themes.permission.C2D_MESSAGE": 4088, "com.ril.ajio.permission.C2D_MESSAGE": 11537, "com.ztemt.launcher.permission.WRITE_SETTINGS": 14395, "www.platformstory.com.me.pokepia.permission.C2D_MESSAGE": 17198, "com.spn.panclinic.permission.MAPS_RECEIVE": 12461, "com.htc.sense.browser.permission.INITIALIZE_DATABASE": 7477, "com.developandroid.android.cars.permission.C2D_MESSAGE": 4952, "com.rgo47.app.permission.C2D_MESSAGE": 11524, "com.jovago.asia.android.permission.C2D_MESSAGE": 8160, "com.lenskart.app.permission.C2D_MESSAGE": 8657, "com.daraz.android.permission.C2D_MESSAGE": 4835, "com.newtreasure.gaple.test.android.permission.C2D_MESSAGE": 10191, "com.greengold.satish.piano.permission.C2D_MESSAGE": 6994, "flyjam.InstantTraductorLight.permission.C2D_MESSAGE": 14833, "com.inditex.ecommerce.bershka.permission.C2D_MESSAGE": 7778, "vuachoibai.vuabai.gamebai.permission.C2D_MESSAGE": 17151, "com.engie.permission.C2D_MESSAGE": 5484, "android.permission.CAMER": 556, "sands.mapCoordinates.android.permission.C2D_MESSAGE": 16778, "com.online.shopping.newvks.permission.C2D_MESSAGE": 10589, "com.mozillaonline.meituxiuxiu.permission.SEND_DOWNLOAD_COMPLETED_INTENTS": 9787, "nl.hbo.hbogo.permission.C2D_MESSAGE": 16279, "com.mountain.tracks.permission.C2D_MESSAGE": 9776, "com.alibaba.android.rimet.permission.MIPUSH_RECEIVE": 2331, "com.twitter.flight2015.permission.C2D_MESSAGE": 13370, "com.amazon.mShop.android.permission.MAPS_RECEIVE": 2422, "de.sport1.bulimanager.permission.C2D_MESSAGE": 14642, "com.holosfind.showroom.permission.C2D_MESSAGE": 7323, "android.permission.GET_TASK": 645, "com.fanduel.nbaturbo.permission.C2D_MESSAGE": 5764, "com.rfvijn.Android_GF_CoinNL_Rolling.permission.C2D_MESSAGE": 11523, "br.com.tapps.sharkevolution.permission.C2D_MESSAGE": 1572, "com.moovechat.permission.C2D_MESSAGE": 9750, "com.jumia.house.android.permission.A4S_SEND": 8205, "com.thenigo.bimsalabim.permission.C2D_MESSAGE": 13027, "org.worona.android.worona_blog.permission.C2D_MESSAGE": 16469, "com.idlegames.eldorado.permission.C2D_MESSAGE": 7665, "com.meetup.permission.MAPS_RECEIVE": 9214, "de.cellular.galileo.permission.C2D_MESSAGE": 14538, "com.itxavor.allsimpackages.permission.C2D_MESSAGE": 7984, "net.one97.paytm.permission.UA_DATA": 16202, "com.cupidly.hookup.permission.C2D_MESSAGE": 4759, "com.whaleshark.retailmenot.permission.RECEIVE_ADM_MESSAGE": 13971, "com.go.abclocal.ktrk.android.weather.permission.C2D_MESSAGE": 6622, "ru.litres.android.flybook.permission.C2D_MESSAGE": 16724, "com.mobirate.planeinsane.gplay.permission.C2D_MESSAGE": 9641, "com.arshad.map.permission.MAPS_RECEIVE": 3229, "com.wleforumducampingcar3.permission.C2D_MESSAGE": 14041, "sts.al.permission.C2D_MESSAGE": 16904, "com.nfl.fantasy.core.android.permission.C2D_MESSAGE": 10222, "com.samsung.android.providers.context.permission.WRITE_RECORD_AUDIO": 11712, "com.kdanmobile.android.pdfreader.google.pad.permission.C2D_MESSAGE": 8320, "com.tedrasoft.citiesquiz.permission.C2D_MESSAGE": 12838, "com.msi.icongame.permission.C2D_MESSAGE": 9814, "com.ttech.android.onlineislem.permission.C2D_MESSAGE": 13332, "ru.gmsoft.magazines.megamozg.permission.C2D_MESSAGE": 16710, "de.affinitas.za.co.elitesingles.and.permission.C2D_MESSAGE": 14510, "br.com.primelan.primespotarena.permission.C2D_MESSAGE": 1531, "com.wEdgeforAndroid.permission.C2D_MESSAGE": 13772, "me.whitebeard.jamaloukimobile.permission.C2D_MESSAGE": 15838, "android.permission.MANAGE_SOUND_TRIGGER": 693, "rierie.media.audiorecorder.permission.C2D_MESSAGE": 16657, "com.gpshopper.adidas.permission.C2D_MESSAGE": 6948, "com.jagplay.client.android.app.jagchess.permission.C2D_MESSAGE": 8016, "com.wGeckoBrowserforAndroid.permission.C2D_MESSAGE": 13796, "se.feomedia.quizkampen.no.lite.permission.C2D_MESSAGE": 16802, "com.android.broswer.permission.WRITE_HISTORY_BOOKMARKS": 2499, "com.ms.coupleobserver.permission.C2D_MESSAGE": 9805, "com.myxl.prepaid.permission.C2D_MESSAGE": 9964, "salon.look.ui.permission.C2D_MESSAGE": 16771, "com.fitivity.basketball_shooting.permission.C2D_MESSAGE": 5877, "com.viettel.vpmt.mobiletv.permission.C2D_MESSAGE": 13578, "com.claroColombia.contenedor.permission.UA_DATA": 4364, "com.jio.media.mobile.apps.jiobeats.permission.C2D_MESSAGE": 8105, "air.FingerVsAxesAndroid.permission.C2D_MESSAGE": 53, "air.timuzsolutions.monsterridehdpro.permission.C2D_MESSAGE": 231, "com.dubizzle.horizontal.permission.MAPS_RECEIVE": 5275, "com.embrace_2redbeans.permission.C2D_MESSAGE": 5457, "android.permission.READ_CONTACTS": 779, "com.wCMSHelmets.permission.C2D_MESSAGE": 13744, "com.arabeyes.wallpaper.permission.C2D_MESSAGE": 3189, "com.olr.rechargeitnow.permission.C2D_MESSAGE": 10504, "com.manash.purplle.permission.C2D_MESSAGE": 9025, "com.boyaa.dummy.permission.C2D_MESSAGE": 3955, "com.freedompop.ott.permission.READ_DATABASE": 6069, "com.kt.android.showtouch.permission.MAPS_RECEIVE": 8536, "com.com2us.soulcollector.normal.freefull.google.global.android.common.permission.C2D_MESSAGE": 4480, "com.5see.android.permissions.READ_LOCAL_DB": 1820, "com.trtf.blue.permission.ACCESS_PROVIDER": 13300, "com.cbsnews.sixtyminutes.permission.C2D_MESSAGE": 4173, "com.cendana2000.serbabayarmobile.permission.C2D_MESSAGE": 4195, "com.meteoplaza.flash.permission.C2D_MESSAGE": 9275, "android.permission.READ_MMS": 799, "uae.gies.permission.C2D_MESSAGE": 17043, "com.fancykey.emoji.keyboard.indic.permission.C2D_MESSAGE": 5761, "com.iop.conference2016.permission.MAPS_RECEIVE": 7904, "com.alpha.teamworks.simple_fb_downloader.permission.C2D_MESSAGE": 2376, "media.media1e1a.arkadaslik.permission.C2D_MESSAGE": 15846, "ws.e2m.sp.permission.C2D_MESSAGE": 17187, "com.pikpok.fl.play.permission.C2D_MESSAGE": 10925, "com.ubl.spellmaster.permission.C2D_MESSAGE": 13397, "com.lge.launcher.permission.WRITE_SETTINGS": 8689, "at.com.media.markt.permission.UA_DATA": 1235, "com.mob1st.vtex.ladyhairpro.permission.C2D_MESSAGE": 9450, "com.mobapphome.millionaire.tr.permission.C2D_MESSAGE": 9465, "com.mtnmusicplus.akazoo.permission.C2D_MESSAGE": 9829, "com.j2.efax.gcm.permission.C2D_MESSAGE": 8007, "com.riatech.instarepost.permission.C2D_MESSAGE": 11530, "com.nextgenreality.wrt.permission.C2D_MESSAGE": 10211, "com.asos.app.permission.PUSHIO_MESSAGE": 3268, "com.iarts.barbeariabompastor.permission.C2D_MESSAGE": 7611, "com.karmangames.euchre.permission.C2D_MESSAGE": 8283, "com.aircel.retailer.permission.C2D_MESSAGE": 2254, "com.siramdev.whatssapp.videocall.permission.C2D_MESSAGE": 12140, "com.norms.kids.basic.learn.permission.C2D_MESSAGE": 10356, "com.jb.gosms.permission.C2D_MESSAGE": 8048, "net.hideman.free.permission.C2D_MESSAGE": 16136, "com.erepubliklabs.cland.permission.C2D_MESSAGE": 5520, "com.kets1r1recoverformattedsdcardguide.permission.C2D_MESSAGE": 8350, "apps.market.yung.funk.permission.C2D_MESSAGE": 1181, "com.fsecure.ms.safe.browser.permission.WRITE_HISTORY_BOOKMARKS": 6136, "com.allianz.rsa.nl.bosch.gcm.permission.C2D_MESSAGE": 2355, "com.gamevilusa.dungeonlink.android.google.global.normal.permission.C2D_MESSAGE": 6395, "com.carrefour.android.app.ooshop.permission.A4S_SEND": 4123, "com.google.android.googlequicksearchbox.permission.C2D_MESSAGE": 6876, "com.xanh9.danhbai.permission.C2D_MESSAGE": 14114, "com.mominis.permission.preferences.provider.READ_WRITE": 9725, "com.backflipstudios.android.dragonvale.permission.C2D_MESSAGE": 3460, "com.gpshopper.bestbuygamers.android.permission.MAPS_RECEIVE": 6952, "com.mobilesrepublic.appygamer.permission.BIND_SERVICE": 9535, "com.autocop.pro.gcm.permission.C2D_MESSAGE": 3357, "free.find.difference13.permission.C2D_MESSAGE": 14935, "com.mobincube.countrysidesinglescom.permission.C2D_MESSAGE": 9609, "com.app.lasvegasbikefest.permission.C2D_MESSAGE": 2801, "com.samsung.android.email.permission.READ_ATTACHMENT": 11696, "com.tangoapp.permission.C2D_MESSAGE": 12719, "com.htc.home.personalize.permission.WRITE_SCENES": 7436, "com.conduit.app_27a1b4029e8e4869a722f8c409abd4cb.app.permission.C2D_MESSAGE": 4536, "jp.hiraky.furimaalert.permission.C2D_MESSAGE": 15549, "com.flyersoft.moonreader.permission.C2D_MESSAGE": 5950, "com.sarmady.filgoal.permission.C2D_MESSAGE": 11780, "com.xn.xiaoyan.permission.JPUSH_MESSAGE": 14181, "tw.com.aktsk.cineleven.permission.C2D_MESSAGE": 17018, "com.app.suncoastcanaryandfinchclub.permission.C2D_MESSAGE": 2849, "android.webkit.permission.PLUGIN": 1109, "gr.vanderbox.lola.permission.C2D_MESSAGE": 15111, "com.cupidmedia.wrapper.blackcupid.permission.C2D_MESSAGE": 4760, "eu.livesport.Eredmenyek_com.permission.C2D_MESSAGE": 14794, "com.seynse.cardigone.permission.C2D_MESSAGE": 12000, "fr.festivaldecannes.permission.C2D_MESSAGE": 14871, "com.landmarkgroup.landmarkshops.permission.MAPS_RECEIVE": 8605, "tw.appmakertw.com.a347.permission.C2D_MESSAGE": 17015, "com.go.abclocal.wpvi.android.weather.permission.C2D_MESSAGE": 6624, "com.google.android.googleapps.permission.GOOGLE_AUTH.adsense": 6838, "com.anchorfree.kaboom.permission.C2D_MESSAGE": 2466, "com.playfirst.playground.hoteldash.permission.RECEIVE_ADM_MESSAGE": 11002, "android.permission.READ_EXTERNAL_STORAGE": 782, "minskguide.org.permission.C2D_MESSAGE": 15861, "com.msfeedback.activity.permission.C2D_MESSAGE": 9810, "com.aaagame.aaacasino.permission.C2D_MESSAGE": 2059, "mindware.mindgames.permission.C2D_MESSAGE": 15856, "com.microsoft.ignite.permission.C2D_MESSAGE": 9322, "com.worldventures.dreamtrips.permission.C2D_MESSAGE": 14074, "com.qreventos.tecnofidta.permission.C2D_MESSAGE": 11286, "com.chatgum.chat.rooms.permission.C2D_MESSAGE": 4226, "com.flyperinc.flychat.permission.C2D_MESSAGE": 5958, "com.vuabai.permission.C2D_MESSAGE": 13703, "com.fsecure.ultralight.permission.READ": 6144, "com.gp.CaptchaEntry.permission.C2D_MESSAGE": 6944, "com.app_beachhousehd.layout.permission.C2D_MESSAGE": 2872, "com.getanightlife.venueapp.gbt.permission.C2D_MESSAGE": 6483, "net.daum.android.solcalendar.permission.C2D_MESSAGE": 16083, "com.mobincube.android.sc_35AFEA.permission.C2D_MESSAGE": 9568, "com.wonderplanet.CrashFever.permission.C2D_MESSAGE": 14058, "com.mob1st.vtex.femalepet.permission.C2D_MESSAGE": 9449, "com.xenon.cartisan.customer.permission.C2D_MESSAGE": 14128, "com.conduit.app_65e625e89479481ca3dd11d32aba3f7c.app.permission.MAPS_RECEIVE": 4564, "kr.bananasoft.girlfriendsnine.permission.C2D_MESSAGE": 15665, "com.ludia.fgx.permission.C2D_MESSAGE": 8918, "com.AdofGames.BattleOfDots.permission.C2D_MESSAGE": 1831, "android.hardware.type.television": 389, "com.securevpn.securevpn.permission.C2D_MESSAGE": 11959, "com.forsale.forsale.permission.C2D_MESSAGE": 6001, "io.moj.mobile.android.caralarm.permission.C2D_MESSAGE": 15374, "me.nextdoors.WK.permission.C2D_MESSAGE": 15821, "com.tv.audition.auditiontv.permission.C2D_MESSAGE": 13361, "com.maret.maps.permission.MAPS_RECEIVE": 9070, "jp.gmomedia.android.freeml.permission.C2D_MESSAGE": 15545, "com.ubisoft.strategy.annobae.permission.C2D_MESSAGE": 13395, "com.auto_jem.DaDaedu.permission.C2D_MESSAGE": 3352, "getui.permission.GetuiService.com.lesports.glivesports": 15027, "com.dreamweaverlabs.greenacres.permission.C2D_MESSAGE": 5233, "com.aitype.android.lang.fa.permission.C2D_MESSAGE": 2279, "com.easilydo.edge.permission.C2D_MESSAGE": 5348, "com.gn.android.compass.permission.C2D_MESSAGE": 6614, "com.girnarsoft.dealer.cargomotors.permission.C2D_MESSAGE": 6539, "com.airbnb.android.permission.JPUSH_MESSAGE": 2248, "com.amdroidalarmclock.amdroid.permission.MAPS_RECEIVE": 2450, "com.htc.android.mail.permission.WRITE_ACCOUNT": 7402, "jp.co.bbb.ariatheavvenire.permission.C2D_MESSAGE": 15492, "com.mju.newzgram.permission.C2D_MESSAGE": 9420, "com.borjaklyawm.news.permission.C2D_MESSAGE": 3937, "sda.melissa.ai.permission.C2D_MESSAGE": 16786, "com.fabulyst.mobile.permission.C2D_MESSAGE": 5710, "com.iliberi.aplicariumqr.permission.MAPS_RECEIVE": 7731, "com.dada.video.app.permission.C2D_MESSAGE": 4802, "com.argames.doors.permission.C2D_MESSAGE": 3209, "com.qq.AppService.permission.out.CACHE_WRITE_PERMISSION": 11276, "com.sfr.android.redmoncompte.permission.C2D_MESSAGE": 12005, "com.good.gcs.permission.CONTENT_READ": 6682, "cn.eclicks.drivingtest.permission.MIPUSH_RECEIVE": 1751, "com.wLiveDarshanSaiBaba.permission.C2D_MESSAGE": 13819, "com.dialog.aptv.permission.C2D_MESSAGE": 4999, "com.tippingcanoe.holidaypirates.permission.RECEIVE_ADM_MESSAGE": 13118, "com.chic.uvlight.permission.C2D_MESSAGE": 4281, "com.android.voicemail.permission.READ_VOICEMAIL": 2608, "com.ubisoft.owlient.howrse.permission.C2D_MESSAGE": 13393, "android.permission.writeSET_TIME_ZONE": 1100, "br.com.r7developers.eraslot.permission.C2D_MESSAGE": 1532, "com.gameloft.android.ANMP.GloftPDHM.permission.C2D_MESSAGE": 6349, "com.onedial.social.permission.C2D_MESSAGE": 10552, "in.encashea.encasheaapp.permission.MAPS_RECEIVE": 15288, "com.ipmagix.rixosevent.permission.C2D_MESSAGE": 7920, "com.careapplication.permission.MAPS_RECEIVE": 4112, "com.htc.permission.APP_DEFAULT": 7460, "com.googleapps.org.permission.C2D_MESSAGE": 6920, "com.seatgeek.android.permission.C2D_MESSAGE": 11861, "com.linio.android.permission.C2D_MESSAGE": 8772, "com.ideacellular.digitalvideo.permission.ACCESS_DOWNLOAD_MANAGER": 7656, "com.polarnoid.getgiftz.permission.C2D_MESSAGE": 11104, "com.fungenerationlab.mxr3.permission.C2D_MESSAGE": 6202, "xyz.ioob.ld.permission.C2D_MESSAGE": 17217, "all.in.one.calculator.permission.C2D_MESSAGE": 241, "com.gawent.carofdistance.app.permission.JPUSH_MESSAGE": 6435, "com.sap.sapapp.permission.MAPS_RECEIVE": 11770, "com.max.futwager.permission.C2D_MESSAGE": 9120, "animation_944.permission.C2D_MESSAGE": 1115, "com.lguplus.homeiot.permission.C2D_MESSAGE": 8698, "com.ldtxapp.ldtx.permission.MIPUSH_RECEIVE": 8634, "com.kongregate.mobile.battlehand.google.permission.C2D_MESSAGE": 8492, "jp.naver.lineantivirus.android.permission.SMISHING_ALERT": 15577, "com.ludia.dragons.permission.RECEIVE_ADM_MESSAGE": 8913, "com.tencent.legend.permission.C2D_MESSAGE": 12886, "com.iscoolentertainment.castlerun.permission.RECEIVE_ADM_MESSAGE": 7938, "com.clashofc.fhxclashofclans.permission.C2D_MESSAGE": 4365, "com.google.android.apps.enterprise.dmagent.permission.InvokeDMServicePermission": 6745, "com.cyntrxeld.permission.C2D_MESSAGE": 4790, "lagamerie.nope.permission.C2D_MESSAGE": 15721, "getui.permission.GetuiService.com.mp1.bbtk": 15038, "com.sec.android.permission.PERSONAL_MEDIA": 11907, "com.hotbuyone.us.permission.C2D_MESSAGE": 7352, "com.libii.candyfashion.permission.C2D_MESSAGE": 8705, "net.blocksandapp.crazycraft.permission.C2D_MESSAGE": 16056, "com.show.greenbill_G.permission.C2D_MESSAGE": 12094, "com.bluebyteapps.raatkatariqa.permission.C2D_MESSAGE": 3885, "com.libiitech.highschoolsalon.permission.C2D_MESSAGE": 8723, "com.octro.ludolive.permission.C2D_MESSAGE": 10471, "com.owlr.controller.foscam.permission.C2D_MESSAGE": 10721, "com.appgamestudio.games.restaurantquiz.permission.C2D_MESSAGE": 3023, "air.gamebaidoithuong.doithe.2016.permission.C2D_MESSAGE": 210, "com.cg.newyorkcitytowerbuilder.permission.C2D_MESSAGE": 4204, "com.animocabrands.google.eahTeaParty.permission.C2D_MESSAGE": 2674, "com.defacto.android.permission.C2D_MESSAGE": 4887, "jp.arismile.f23a255.permission.C2D_MESSAGE": 15484, "tw.bxb.eew.light.permission.C2D_MESSAGE": 17017, "com.joeware.android.gpulumera.permission.C2D_MESSAGE": 8136, "com.eldev.flygps.permission.C2D_MESSAGE": 5432, "com.appseleration.android.selfcare.permission.C2D_MESSAGE": 3098, "me.doubledutch.ggqbc.eonsupplierinnovation.permission.C2D_MESSAGE": 15816, "com.followmania.permission.C2D_MESSAGE": 5967, "com.beyondapp.permission.GETGAID": 3686, "com.dzs.xuhangeconomiczone.permission.JPUSH_MESSAGE": 5312, "net.corethree.metrobus.permission.MAPS_RECEIVE": 16073, "com.qvghnxp.electrohousemusic.permission.C2D_MESSAGE": 11336, "com.techpebbles.cn.permission.C2D_MESSAGE": 12820, "com.valiprod.actionouverite_hot.permission.C2D_MESSAGE": 13509, "com.conduit.app_c49e45ddaddd48b891ff4477e04771fd.app.permission.MAPS_RECEIVE": 4619, "ru.ykt.eda.permission.C2D_MESSAGE": 16765, "com.android_group.trivia_duel_quiz.permission.C2D_MESSAGE": 2612, "se.feomedia.quizkampen.id.lite.permission.C2D_MESSAGE": 16797, "com.baseproject.positiveapps.gcm.permission.C2D_MESSAGE": 3556, "com.google.android.c2dm.permission.C2D_MESSAGE": 6767, "com.joycrafter.worldwarfare.gp.permission.C2D_MESSAGE": 8169, "com.hearst.android.wcvb.permission.C2D_MESSAGE": 7208, "app.search.sogou.common.permission.ACCESS_DOWNLOAD_MANAGER_ADVANCED": 1167, "com.kakao.wheel.permission.C2D_MESSAGE": 8268, "com.fanzetech.tools.permission.C2D_MESSAGE": 5781, "com.rm.android.wcps.permission.C2D_MESSAGE": 11550, "littleblackbook.com.littleblackbook.lbbdapp.lbb.permission.MAPS_RECIEVE": 15742, "com.philips.moonshot.permission.C2D_MESSAGE": 10898, "com.google.android.apps.googlevoice.permission.AUTO_SEND": 6748, "com.klook.partner.gcm.permission.C2D_MESSAGE": 8461, "com.sina.permission.ACCESS_DOWNLOAD_MANAGER_ADVANCED": 12127, "com.sc.daraz.permission.A4S_SEND": 11805, "com.kikuu.permission.JPUSH_MESSAGE": 8386, "com.ijinshan.browser.permission.MIPUSH_RECEIVE": 7709, "com.supercleaner.permission.ANTI_VIRUS": 12618, "tr.com.media.markt.permission.RECEIVE_ADM_MESSAGE": 16975, "com.notissimus.oodji.Android.permission.C2D_MESSAGE": 10373, "com.uriosweb.appidays.rsvp.permission.C2D_MESSAGE": 13485, "com.decxzSoft.hairStyles.Hair.permission.C2D_MESSAGE": 4885, "com.isuog.conference2016.permission.C2D_MESSAGE": 7956, "com.visualdesign.livefootballontvlite.permission.RECEIVE_ADM_MESSAGE": 13603, "com.ayce.permission.C2D_MESSAGE": 3433, "com.joy.rewards.app.permission.C2D_MESSAGE": 8162, "com.kny.taiwanfreewaycamviewer.permission.C2D_MESSAGE": 8471, "com.mobime.ecooltra.permission.C2D_MESSAGE": 9551, "com.onesolutionapps.firstassuredbailbonds.permission.MAPS_RECEIVE": 10568, "ro.ascendnet.android.agregator.permission.C2D_MESSAGE": 16662, "com.att.android.digitallocker.sync.permission.READ_WRITE_PROVIDERS": 3320, "com.raindropstudio.programmingbasic.permission.C2D_MESSAGE": 11369, "htc.socialmanager.permission.READ_SOCIAL_DATABASE": 15192, "net.slickdeals.android.permission.C2D_MESSAGE": 16229, "com.nanuinteractive.permissions.MainActivity": 9997, "com.ar.augment.permission.C2D_MESSAGE": 3185, "air.com.mastertigra.vreale.permission.C2D_MESSAGE": 144, "net.phcorner.app.permission.C2D_MESSAGE": 16208, "com.appstore.arapps.permission.C2D_MESSAGE": 3141, "zerolab.android.pdown.permission.C2D_MESSAGE": 17238, "com.appxplore.caveboy.permission.C2D_MESSAGE": 3167, "com.doapps.android.mln.MLN_fd1a4a4346d5ba7464d64636d604925e.permission.C2D_MESSAGE": 5123, "com.olsera.olseramobile.budung.permission.C2D_MESSAGE": 10506, "com.qidian.QDReader.permission.WRITE_DB": 11237, "android.hardware.audio.output": 299, "com.catdaddy.mynba2k17.permission.C2D_MESSAGE": 4162, "com.robotemplates.com.regimemiracle.androidapp.permission.C2D_MESSAGE": 11564, "net.daum.android.mail.permission.C2D_MESSAGE": 16082, "com.vodafone.mCare.permission.MAPS_RECEIVE": 13651, "au.com.cricket.permission.C2D_MESSAGE": 1266, "org.hicham.adhan_downloader.permission.C2D_MESSAGE": 16398, "android.permission.RECEIVE_BOOT_COMPLETE": 834, "com.natasa.dragoneggs.permission.C2D_MESSAGE": 10028, "enbd.gaming.banki.permission.C2D_MESSAGE": 14744, "com.amazon.mysampleapp.permission.C2D_MESSAGE": 2427, "com.danhbaidoithuong.gamebai.permission.C2D_MESSAGE": 4826, "com.fitpicapp.farmers_meet.permission.C2D_MESSAGE": 5883, "com.photovideo.hdvideoplayer.permission.C2D_MESSAGE": 10909, "com.mobogenie.permission.RECEIVE_BROADCAST": 9680, "com.bettingtipsapp.freebettingtips.permission.C2D_MESSAGE": 3684, "com.app_britishgp.layout.permission.C2D_MESSAGE": 2879, "com.Ocozzio.SIIA2015.permission.C2D_MESSAGE": 1976, "android.permission.record_audio": 1058, "com.bingo.club.permission.RECEIVE_ADM_MESSAGE": 3772, "gr.blogspot.feasyapps.animalsforkids.permission.C2D_MESSAGE": 15104, "com.dbd.ghosttalk.permission.C2D_MESSAGE": 4864, "com.cricket.ksca.permission.C2D_MESSAGE": 4718, "com.amazon.now.permission.C2D_MESSAGE": 2428, "gov.fema.mobile.android.permission.PushHandlerActivity": 15102, "com.app_bergman.layout.permission.C2D_MESSAGE": 2873, "com.gamebility.coloringbook.permission.C2D_MESSAGE": 6311, "com.aufeminin.beautiful.permission.C2D_MESSAGE": 3340, "com.kraftly.app.permission.LAYER_PUSH": 8519, "com.htc.launcher.permission.SETUP_HOME_LAYOUT": 7450, "cn.safetrip.edog.permission.JPUSH_MESSAGE": 1762, "com.businesslinktrading.makani.permission.C2D_MESSAGE": 4041, "com.appmahal.app.permission.C2D_MESSAGE": 3060, "com.yournet.asobo.browser.permission.C2D_MESSAGE": 14256, "com.pcbasictraining.z.vehicleledger.permission.C2D_MESSAGE": 10828, "br.com.rodrigokolb.realdrum.permission.C2D_MESSAGE": 1539, "com.hugogames.axeinface2.universal.permission.RECEIVE_ADM_MESSAGE": 7566, "qa.vodafone.myvodafone.permission.C2D_MESSAGE": 16628, "com.SarahAnderson.flirtforfemales.permission.C2D_MESSAGE": 1996, "com.umonistudio.tile.permission.C2D_MESSAGE": 13446, "com.app_ravfm.layout.permission.C2D_MESSAGE": 2963, "com.game.bai.tien.len.miennam.permission.C2D_MESSAGE": 6280, "de.bauerlive.presentmanager.permission.C2D_MESSAGE": 14525, "com.fitness.newwomenapp.permission.C2D_MESSAGE": 5882, "com.google.android.googleapps.permission.GOOGLE_AUTH.lh2": 6857, "android.permission.READ_LOGS": 797, "se.feomedia.quizkampen.base.permission.C2D_MESSAGE": 16791, "it.deeptelegram.messenger.permission.MAPS_RECEIVE": 15397, "com.aitype.smileyart.permission.C2D_MESSAGE": 2286, "com.guruinfomedia.memory.cache.permission.C2D_MESSAGE": 7082, "com.taptrip.permission.C2D_MESSAGE": 12753, "com.mob1st.vtex.revendedorthipos.permission.C2D_MESSAGE": 9451, "com.mobilegameart.fortunecookie.permission.C2D_MESSAGE": 9505, "com.shopback.app.permission.C2D_MESSAGE": 12071, "de.momox.permission.C2D_MESSAGE": 14613, "com.samsung.mdl.radio.permission.WRITE_RADIO_STORAGE": 11733, "com.fission.sevennujoom.permission.C2D_MESSAGE": 5874, "com.etsy.android.soe.permission.C2D_MESSAGE": 5588, "com.india.allinoneshopping.permission.C2D_MESSAGE": 7766, "com.pruebas.prueba.permission.C2D_MESSAGE": 11197, "net.mobigame.zombietsunami.permission.C2D_MESSAGE": 16183, "it.doveconviene.android.permission.C2D_MESSAGE": 15400, "com.astrotek.hp.pixicam.permission.C2D_MESSAGE": 3280, "android.permission.ACCESS_NETWORK_CONFIGURATION": 460, "com.renren.permission.ACCESS_DOWNLOAD_MANAGER": 11487, "com.zippyraft.millionaire.permission.C2D_MESSAGE": 14355, "com.kobobooks.android.orbile.permission.C2D_MESSAGE": 8475, "com.tionnet.getitstar.permission.C2D_MESSAGE": 13115, "com.google.maps.android.utils.permission.MAPS_RECEIVE": 6918, "com.bianor.ams.permission.C2D_MESSAGE": 3709, "com.android.setting.permission.ALLSHARE_CAST_SERVICE": 2590, "com.android.launcher.permission.UNINSTALL_SHORTCUT": 2536, "livestreet.mapview.map.permission.C2D_MESSAGE": 15744, "com.pinktwins.mesh.permission.C2D_MESSAGE": 10950, "com.mobincube.trucos_y_guia_para_pokemon_go_2016_en_espanol.permission.C2D_MESSAGE": 9630, "com.fluik.Explosions.permission.C2D_MESSAGE": 5945, "com.ujoy.sm.permission.C2D_MESSAGE": 13412, "net.giosis.shopping.hub.permission.C2D_MESSAGE": 16116, "com.app.latinotvlive.permission.C2D_MESSAGE": 2803, "com.galaxys.launcher.permission.READ_SETTINGS": 6272, "com.cf.flightsearch.permission.C2D_MESSAGE": 4201, "mobi.infolife.ezweather.widget.dawn.permission.C2D_MESSAGE": 15909, "com.chatous.chatous.permission.C2D_MESSAGE": 4227, "com.abercrombie.hollister.permission.RECEIVE_ADM_MESSAGE": 2088, "com.ushareit.listenit.permission.C2D_MESSAGE": 13495, "com.avis.androidapp.permission.C2D_MESSAGE": 3405, "com.duobao.oversea.permission.SEND_DOWNLOAD_COMPLETED_INTENTS": 5290, "studiomignot_22.permission.C2D_MESSAGE": 16909, "com.auscakstudio.runnersforbiddenforest.permission.C2D_MESSAGE": 3349, "com.kkmlauncher.permission.READ_SETTINGS": 8436, "ro.carzz.permission.C2D_MESSAGE": 16664, "com.mcc.gpstar.permission.C2D_MESSAGE": 9140, "com.amc.permission.MAPS_RECEIVE": 2444, "com.wiziapp.app_b23ab348a927a3799ad02dc3f4240c7a.permission.C2D_MESSAGE": 14033, "com.linecorp.LGSDG.permission.C2D_MESSAGE": 8760, 