{"android.hardware.camera2.autofocus": 37, "android.hardware.camera.capability.manual_post_processing": 26, "com.ssaurel.cpuhardwareinfos.activities.MainActivity": 121, "android.hardware.location.location": 58, "android.hardware.sensor.relative_humidity": 87, "android.hardware.location.GPS": 54, "android.hardware.audio.low_latency": 14, "android.hardware.sensor.hifi_sensors": 83, "android.hardware.proximity": 68, "android.hardware.bluetooth_le": 19, "android.hardware.camera.autofocus": 24, "android.hardware.faketouch.multitouch.distinct": 44, "android.hardware.camera.AUTOFOCUS": 21, "android.hardware.faketouch": 42, "android.hardware.camera.front": 32, "android.hardware.screen.LANDSCAPE": 70, "android.hardware.CAMERA": 2, "com.ssaurel.cpuhardwareinfos": 120, "android.hardware.telephony.gsm": 95, "android.hardware.touchscreen.pen": 103, "android.hardware.camera": 20, "android.hardware.sensor.heartrate.ecg": 82, "android.hardware.flash": 47, "lge.hardware.real3d.barrier.landscape": 124, "android.hardware.usb.accessory": 109, "android.hardware.sip.voip": 91, "androidhardware.telephony": 118, "android.hardware.fingerprint": 46, "android.hardware.location.network": 59, "android.hardware.touchscreen.multitouch": 100, "android.hardware.camera.front.autofocus": 33, "com.themonsterit.hardwaretest.main": 123, "android.hardware.NFC": 8, "android.hardware.audio.output": 15, "android.hardware.vr.high_performance": 113, "android.hardware.microphone": 61, "android.hardware.camera.flashlight": 31, "android.hardware.sensor.stepcounter": 88, "android.hardware.usb.action.USB_DEVICE_ATTACHED": 110, "android.hardware.touchscreen.multitouch.jazzhand": 102, "android.hardware.sensor.gyroscope": 80, "android.hardware.audio.pro": 16, "android.hardware.camera.setParameters": 35, "android.hardware.nfc.hce": 64, "android.hardware.LOCATION": 6, "android.hardware.touchscreen.multitouc": 99, "android.hardware..": 0, "android.hardware.type.television": 105, "android.hardware.gamepad": 48, "android.hardware.gsm": 50, "android.hardware.wifi": 115, "android.hardware.camera2.full": 39, "android.hardware.preview.any": 67, "android.hardware.camera.capability.raw": 28, "android.hardware.screen": 69, "android.hardware.locations.gps": 60, "android.hardware.gps": 49, "android.hardware.camera2": 36, "android.hardware.Sensor": 9, "android.permission.android.hardware.sensor.accelerometer": 117, "android.hardware.sensor.ambient_temperature": 77, "android.hardware.wifi.direct": 116, "android.hardware.screen.landscape": 72, "android.hardware.usb.host": 111, "android.hardware.Camera": 3, "android.hardware.nfc": 63, "android.hardware.consumerir": 41, "android.hardware.bluetooth": 18, "android.hardware.TELEPHONY": 10, "android.hardware.vibrate": 112, "android.hardware.BLUETOOTH": 1, "android.hardware.screen.lanscape": 73, "android.hardware.WRITE_SMS": 13, "android.hardware.location.": 53, "android.hardware.landscape": 51, "android.hardware.location.bluetooth": 56, "android.hardware.camera.autoFocus": 23, "android.hardware.location.NETWORK": 55, "android.hardware.telephony": 92, "android.hardware.network": 62, "android.hardware.sensor.light": 84, "android.hardware.location.gps": 57, "android.hardware.camera.external": 29, "android.hardware.MICROPHONE": 7, "android.hardware.output": 65, "android.hardware.FAKETOUCH": 5, "android.hardware.WIFI": 12, "android.hardware.touchscreen.landscape": 98, "android.hardware.camera.any": 22, "android.hardware.toucscreen": 104, "android.hardware.telephony.SEND_SMS": 93, "android.hardware.camera.capability.manual_sensor": 27, "android.hardware.usb": 107, "android.hardware.touchscreen": 97, "com.themonsterit.hardwaretest": 122, "android.hardware.telephony.lte": 96, "android.hardware.vulkan": 114, "android.hardware.usb.UsbAccessory": 108, "android.hardware.screen.portrait": 74, "android.hardware.sensor.heartrate": 81, "android.hardware.sensor": 75, "android.hardware.sensor.pressure": 85, "android.hardware.portrait": 66, "android.hardware.Camera.autofocus": 4, "android.hardware.sensor.compass": 79, "android.hardware.telephony.cdma": 94, "android.hardware.camera.flash": 30, "android.hardware.camera2.flash": 38, "com.android.hardware.location.gps": 119, "android.hardware.sensor.accelerometer": 76, "android.hardware.TOUCHSCREEN": 11, "android.hardware.touchscreen.multitouch.distinct": 101, "android.hardware.faketouch.multitouch.jazzhand": 45, "android.hardware.camers.autofocus": 40, "android.hardware.sensor.stepdetector": 89, "android.hardware.sensor.temperature": 90, "android.hardware.sensor.barometer": 78, "android.hardware.sensor.proximity": 86, "android.hardware.camera.back": 25, "android.hardware.screen.PORTRAIT": 71, "android.hardware.location": 52, "android.hardware.camera.level.full": 34, "android.hardware.faketouch.": 43, "android.hardware.type.watch": 106, "android.hardware.autofocus": 17}