{"com.mola.playspace.android.domino.permission.PAYMENT_BROADCAST": 9604, "com.psd2filters.glitchart.permission.C2D_MESSAGE": 11081, "com.hidating.hidatingapp.permission.C2D_MESSAGE": 7134, "com.pereira.live.permission.C2D_MESSAGE": 10748, "in.adityaanand.gre.permission.C2D_MESSAGE": 15141, "com.minhdafpt.com.vn.sendoseller.permission.C2D_MESSAGE": 9258, "com.altermyth.bima.tablet.permission.C2D_MESSAGE": 2264, ".permission.A4S_SEND": 3, "com.autonetmobile.dealerconnect.permission.C2D_MESSAGE": 3249, "com.facebook.android.permission.C2D_MESSAGE": 5594, "android.Manifest.permission.FORCE_STOP_PACKAGES": 270, "com.mobilizeit.ossbss2016.permission.C2D_MESSAGE": 9428, "com.quvideo.xiaoying.permission.C2D_MESSAGE": 11213, "com.phonecastsolutions.bzreisadvies.permission.MAPS_RECEIVE": 10782, "com.nanoequipment.lightning.permission.MAPS_RECEIVE": 9874, "net.xnano.android.changemymac.permission.C2D_MESSAGE": 16121, "com.adnet.getinvolved.permission.C2D_MESSAGE": 2047, "android.permission.ACCESS_LOCATTON_MOCK_LOCATION": 334, "android.permission.BIND_INPUT_METHOD": 403, "com.iphonedroid.expansion.permission.C2D_MESSAGE": 7797, "com.aff.randijoy.permission.C2D_MESSAGE": 2089, "org.cosinus.aviatool.permission.C2D_MESSAGE": 16243, "com.claroBrasil.contenedor.permission.UA_DATA": 4242, "armando_32.permission.C2D_MESSAGE": 1078, "com.blacklight.klondike.patience.solitaire.permission.C2D_MESSAGE": 3739, "com.zikosdev.girly.permission.C2D_MESSAGE": 14222, "com.perk.livetv.aphone.permission.C2D_MESSAGE": 10756, "com.allinoneremote.permission.C2D_MESSAGE": 2239, "tv.shou.android.permission.C2D_MESSAGE": 16889, "com.cv.cds.library.permission.C2D_MESSAGE": 4651, "com.karaoke.login.permission.C2D_MESSAGE": 8160, "com.delitestudio.filetransferfree.permission.C2D_MESSAGE": 4783, "com.taplane.logoquiz.permission.C2D_MESSAGE": 12621, "com.cybermind.google.famecelebritystory.permission.C2D_MESSAGE": 4666, "bankers.addahindi.permission.C2D_MESSAGE": 1214, "com.android.droidapps.permission.C2D_MESSAGE": 2394, "com.fhxserver.ultimate.permission.C2D_MESSAGE": 5717, "epson.print.permission.C2D_MESSAGE": 14628, "es.socialpoint.hydra.permissions.PermissionsActivity": 14652, "com.resultsclue.timetable12th.permission.C2D_MESSAGE": 11383, "com.novel.reader.pushnotification.permission.C2D_MESSAGE": 10262, "android.permission.SENSOR_INFO": 773, "com.ants.wip.permission.C2D_MESSAGE": 2583, "com.qq.AppService.permission.out.CACHE_READ_PERMISSION": 11156, "com.seal.permissions.services.ADDONS": 11728, "com.directv.navigator.permission.UA_DATA": 4932, "com.hp.android.printservice.permission.C2D_MESSAGE": 7253, "jp.naver.line.android.permission.C2D_MESSAGE": 15449, "com.wLiveSport_3874729.permission.C2D_MESSAGE": 13697, "nichetech.malayalam.editor.permission.C2D_MESSAGE": 16138, "com.baniyadeals.baniyadeals.permission.C2D_MESSAGE": 3421, "au.com.homeloveapp.permission.C2D_MESSAGE": 1154, "com.sports.schedules.basketball.nba.permission.C2D_MESSAGE": 12346, "com.amazon.dcp.sso.permission.CUSTOMER_ATTRIBUTE_SERVICE": 2289, "com.qihoo360.screenlock.permission.READ_LOCAL_THEME": 11138, "com.transsion.phoenix.permission.READ_HOMEPAGE": 13129, "com.bolavip.permission.C2D_MESSAGE": 3795, "android.permission.REQUEST_INSTALL_PACKAGES": 742, "com.Settings.widget.permission.SettingsAppWidgetProvider": 1886, "com.sanaedutech.tnpsc.permission.C2D_MESSAGE": 11641, "com.netatmo.camera.permission.C2D_MESSAGE": 9993, "fr.meilleurlogiciel.holyquranpro.permission.C2D_MESSAGE": 14772, "org.mcapp.app56bf7cea40703.permission.C2D_MESSAGE": 16289, "com.coccoc.trinhduyet.permission.READ_WRITE_BOOKMARK_FOLDERS": 4300, "com.smart.control.ipanel.permission.C2D_MESSAGE": 12108, "com.birdcash.permission.C2D_MESSAGE": 3659, "com.example.makani.permission.MAPS_RECEIVE": 5530, "com.auer.pushnotification.permission.C2D_MESSAGE": 3220, "com.rvappstudios.fingerslayer.permission.C2D_MESSAGE": 11523, "com.gingersoftware.android.keyboard.permission.C2D_MESSAGE": 6393, "com.treemolabs.apps.cnet.permission.C2D_MESSAGE": 13139, "com.kaazzaan.airpanopanorama.permission.MAPS_RECEIVE": 8125, "com.tecarta.OnceADay.permission.C2D_MESSAGE": 12684, "com.gettogether.permission.C2D_MESSAGE": 6377, "com.mylocaltv.kptvdroid.permission.C2D_MESSAGE": 9806, "com.reticode.lovemessages.permission.C2D_MESSAGE": 11389, "com.solodroid.materialwallpaper.permission.C2D_MESSAGE": 12213, "kidgames.christmas.pack.permission.C2D_MESSAGE": 15511, "com.shop.ini.permission.C2D_MESSAGE": 11950, "com.bigfans.crreminder.permission.C2D_MESSAGE": 3624, "com.doapps.android.mln.MLN_e4c7991c840bd4665a1f9c72441b069c.permission.C2D_MESSAGE": 5002, "com.pikpok.mm.play.permission.C2D_MESSAGE": 10809, "org.opengapps.app.permission.C2D_MESSAGE": 16307, "com.zing.zalo.permission.BIND_ZALO_SERVICE": 14230, "se.scmv.morocco.permission.C2D_MESSAGE": 16692, "com.scanapps.moodscanner3.permission.C2D_MESSAGE": 11696, "com.tentkls.Wreath.permission.C2D_MESSAGE": 12830, "android.permission.GET_CLIPS": 520, "com.newssynergy.pahomepageweather.permission.C2D_MESSAGE": 10064, "com.sirmamobile.prodavalnik.permission.C2D_MESSAGE": 12024, "android.permission.INSTALL_GRANT_RUNTIME_PERMISSIONS": 544, "jp.digitallab.raideengroup.permission.C2D_MESSAGE": 15419, "com.xiaomi.sdk.permission.PAYMENT": 14021, "com.urbanairship.push.sample.permission.RECEIVE_ADM_MESSAGE": 13358, "com.eyemakeuptipstamil.eyemakeupideas.permission.C2D_MESSAGE": 5576, "com.ileadgame.arabempire.permission.C2D_MESSAGE": 7606, "me.doubledutch.tcecsummer.permission.C2D_MESSAGE": 15693, "com.don.offers.permission.C2D_MESSAGE": 5046, "com.freegame.bingo.permission.C2D_MESSAGE": 5959, "android.permission.CHANGE_NETWORK_STATE": 459, "android.permission.ACCESS_COARSE": 309, "com.nuke.guideresidentevil4.permission.C2D_MESSAGE": 10294, "com.alawar.wbzgauwbzha.permission.C2D_MESSAGE": 2195, "com.kamusegames.fishingtour.permission.C2D_MESSAGE": 8156, "com.vbox7.permission.C2D_MESSAGE": 13399, "com.mtsgames.cargotrainssimulator.permission.C2D_MESSAGE": 9716, "com.ultimategamestudio.mcpecenter.seeds.gcm.permission.C2D_MESSAGE": 13310, "de.saturn.clockshopwidget.permission.C2D_MESSAGE": 14513, "com.dreamstep.wFetVancouver.permission.C2D_MESSAGE": 5105, "net.fussballtransfers.mobile.permission.C2D_MESSAGE": 15984, "com.DigitGaming.kotrqa.permission.UA_DATA": 1764, "com.conduit.app_65e625e89479481ca3dd11d32aba3f7c.app.permission.RECEIVE_ADM_MESSAGE": 4446, "com.el.empregoligado.permission.C2D_MESSAGE": 5307, "com.shoujiduoduo.ringtone.permission.MIPUSH_RECEIVE": 11974, "air.fire.game.zombiewar.dead.clashking.permission.C2D_MESSAGE": 206, "com.alfacart.alfamikroapp.permission.C2D_MESSAGE": 2208, "com.blablaapp.launcher.permission.C2D_MESSAGE": 3699, "android.permission.NET_CANBUS": 618, "com.qihoo.antivirus.update.permission.clear_sdk_lds": 11119, "android.permission.ACCESS_FIND_LOCATION": 321, "com.kilogames.subwayserferchg.permission.C2D_MESSAGE": 8270, "com.WhatWapp.BuracoOnlineBR.permission.C2D_MESSAGE": 1915, "es.mmip.prisacom.as.permission.RECEIVE_ADM_MESSAGE": 14645, "xyz.livenettv.stream.permission.C2D_MESSAGE": 17094, "com.minecrfattutorial.diego.minecraftbuildinghouse.permission.C2D_MESSAGE": 9248, "gr.vanderbox.guythegnetwork.permission.C2D_MESSAGE": 14987, "com.umonistudio.tile.permission.AIDL_SERVICE": 13322, "com.app.p1180DJ.permission.C2D_MESSAGE": 2689, "com.wastech.social.permission.C2D_MESSAGE": 13755, "com.google.android.c2dm.permission.RECEIVE": 6650, "br.com.rodrigokolb.congasandbongosfree.permission.C2D_MESSAGE": 1416, "com.android.alarm.permission.GET_ALARM": 2373, "com.ss.android.essay.joke.permission.MIPUSH_RECEIVE": 12381, "ro.mercador.permission.C2D_MESSAGE": 16545, "com.membertek.otg.permission.C2D_MESSAGE": 9128, "com.google.android.gms.trustagent.permission.TRUSTAGENT_STATE": 6714, "getui.permission.GetuiService.com.allfootball.news": 14870, "com.footlocker.canada.permission.BEACON_RESULT_RECEIVE": 5862, "com.planoly.android.permission.C2D_MESSAGE": 10872, "com.freedomltd.FreedomApp.permission.C2D_MESSAGE": 5946, "com.shrtech.cellphonetricks.permission.C2D_MESSAGE": 11981, "com.andropenoffice.permission.EXTENSIONS": 2521, "com.yamaha.jp.dataviewer.permission.MAPS_RECEIVE": 14089, "com.raytechnos.marathidictionary.permission.C2D_MESSAGE": 11297, "android.permission.USER_PRESENT": 832, "binaryearth.handyunits.permission.C2D_MESSAGE": 1261, "com.appeteria.battery100alarm.permission.C2D_MESSAGE": 2897, "it.spazioit.melonicalzature.permission.C2D_MESSAGE": 15314, "com.asos.app.permission.C2D_MESSAGE": 3148, "com.baidu.launcher.i18n.permission.RECEIVE_LAUNCH_BROADCASTS": 3363, "fr.sopheos.loto.permission.MAPS_RECEIVE": 14784, "com.bayer.bcs.farmingsfuture.permission.C2D_MESSAGE": 3453, "de.is24.hausbauphone.permission.C2D_MESSAGE": 14457, "prod.lemondev.gralpy.permission.C2D_MESSAGE": 16474, "android.permission.android.permission.MANAGE_ACCOUNTS": 918, "com.disney.disneyrestaurant_goo.permission.C2D_MESSAGE": 4945, "net.edarling.mobile.permission.C2D_MESSAGE": 15965, "com.chic.ledstrobo.permission.C2D_MESSAGE": 4159, "ag.sportradar.android.livescore.base.permission.C2D_MESSAGE": 42, "lri.game.blox.permission.C2D_MESSAGE": 15635, "com.abtnprojects.ambatana.permission.C2D_MESSAGE": 1978, "com.blacklight.spidersolitaire.gcm.permission.C2D_MESSAGE": 3740, "mobi.SyndicateApps.ICS.launcher.permission.WRITE_SETTINGS": 15755, "com.app_cimaapp.layout.permission.C2D_MESSAGE": 2770, "com.nhn.android.nbooks.permission.C2D_MESSAGE": 10118, "com.freeinternet1.permission.C2D_MESSAGE": 5961, "com.nWeave.AppleADay.permission.C2D_MESSAGE": 9849, "ro.mercador.permission.UA_DATA": 16547, "call.free.international.callvibes.permission.C2D_MESSAGE": 1536, "com.wtvg.abc13radar.permission.MAPS_RECEIVE": 13972, "gbis.gbandroid.permission.C2D_MESSAGE": 14855, "the.pdfviewer3.permission.C2D_MESSAGE": 16815, "air.com.neon.games.WBT.permission.C2D_MESSAGE": 150, "com.mhapps.feen.permission.MAPS_RECEIVE": 9184, "com.longtech.lastwars.gp.permission.C2D_MESSAGE": 8745, "com.gz.zeitgeist.permission.C2D_MESSAGE": 6987, "com.rovio.angrybirdsseasons.permission.C2D_MESSAGE": 11479, "com.bikroy.permission.LAYER_PUSH": 3646, "com.careerjet.android.permission.C2D_MESSAGE": 3997, "com.smartfren.permission.MAPS_RECEIVE": 12116, "com.opera.max.permission.GET_MIGRATION_DATA": 10513, "com.bobby.carrothd.permission.C2D_MESSAGE": 3789, "com.elevenst.permission.C2D_MESSAGE": 5321, "android.permission.CAM": 438, "com.irac.irac.permission.C2D_MESSAGE": 7807, "com.trendmicro.dr.booster.permission.C2D_MESSAGE": 13145, "com.deway.ampla.permission.C2D_MESSAGE": 4851, "knk.music.KingSoftOfficer.shortcuts.permission.C2D_MESSAGE": 15537, "com.iart.chromecastapps.permission.C2D_MESSAGE": 7491, "com.chan.vuong.chanpro.permission.C2D_MESSAGE": 4092, "android.permission.HUAWEI_SYSTEM_NODE_ACCESS": 538, "com.ulmon.android.citymaps2go.permission.C2D_MESSAGE": 13296, "android.permission.RESET_BATTERY_STATS": 743, "kewi.mobi.nhc2016.permission.MAPS_RECEIVE": 15506, "android.permission.BIND_REMOTEVIEWS": 407, "android.permission.RECEIVE_USER_PRESENT": 729, "ba.pik.v2.android.permission.C2D_MESSAGE": 1193, "com.mbolotener.gamingapp.permission.C2D_MESSAGE": 9014, "com.vixlet.mlb.permission.RECEIVE_ADM_MESSAGE": 13500, "com.nekki.shadowfight.permission.C2D_MESSAGE": 9967, "com.sec.android.app.twlauncher.permission.READ_SETTINGS": 11771, "com.tencent.qav.permission.broadcast": 12794, "com.bambo.soccerfight.permission.C2D_MESSAGE": 3397, "com.salmansaleh.cartheftprotection.permission.MAPS_RECEIVE": 11550, "nl.ncrv.eentegen100.permission.C2D_MESSAGE": 16160, "android.permission.BROADCAST_PACKAGE_REPLACED": 425, "com.garena.game.jetvn.permission.C2D_MESSAGE": 6298, "com.wmosafr.permission.C2D_MESSAGE": 13920, "uk.gov.metoffice.android.permission.C2D_MESSAGE": 16940, "com.boyaa.catur.permission.C2D_MESSAGE": 3834, "hotspotshield.android.vpn.permission.C2D_MESSAGE": 15045, "org.freecoder.permission.OVERCLOCK_ACTIVITY": 16262, "com.wFindMeAnywhereLive.permission.C2D_MESSAGE": 13662, "air.AngryRedButtonAndroid.permission.C2D_MESSAGE": 47, "com.conduit.app_ad3b1ff51c394859b440bdc580086caf.app.permission.RECEIVE_ADM_MESSAGE": 4490, "com.taxi123Customer.permission.C2D_MESSAGE": 12645, "org.chromium.chrome.permission.C2D_MESSAGE": 16238, "com.liked.wow.permission.C2D_MESSAGE": 8626, "com.google.cloud.backend.permission.C2D_MESSAGE": 6796, "com.libiitech.candybeautysalon.permission.C2D_MESSAGE": 8596, "com.superluckycasino.doubleup.slots.vegas.android.free.permission.C2D_MESSAGE": 12503, "com.huawei.android.launcher.permission.READ_SETTINGS": 7398, "lequipe.fr.permission.C2D_MESSAGE": 15611, "com.aryservices.aryud.permission.C2D_MESSAGE": 3121, "jp.co.excite.amiple.permission.C2D_MESSAGE": 15378, "com.dcrs.permission.JPUSH_MESSAGE": 4749, "com.mangguotv.aaa.www.permission.JPUSH_MESSAGE": 8910, "tr.atv.permission.C2D_MESSAGE": 16845, "com.premiumsoftware.animalsoundsandphotos.permission.C2D_MESSAGE": 11017, "com.digitalfrog.funmatgoG2.permission.C2D_MESSAGE": 4913, "it.sephora.sephoraitaly.permission.A4S_SEND": 15307, "net.rention.appointmentsplanner.permission.C2D_MESSAGE": 16095, "open.menthal.permission.MAPS_RECEIVE": 16204, "com.widefide.facebookapp.permission.C2D_MESSAGE": 13876, "com.mobilizeit.meetapp3.valmet.permission.C2D_MESSAGE": 9424, "telhadopao_468.permission.C2D_MESSAGE": 16808, "com.android.hipstore.gcm.permission.C2D_MESSAGE": 2403, "com.myntra.android.permission.C2D_MESSAGE": 9820, "com.htc.camera2.permission.GET_STATE": 7288, "com.c51.permission.C2D_MESSAGE": 3946, "com.twobrothers.kids_numbers_and_english_alphabets_learning.permission.C2D_MESSAGE": 13248, "com.tencent.mtt.base.stat.permission.WRITE_STATDB": 12785, "nz.co.vodafone.android.myaccount.permission.MAPS_RECEIVE": 16186, "com.weather.Weather.permission.C2D_MESSAGE": 13788, "com.game.mobile.atxionline.permission.C2D_MESSAGE": 6170, "adu1.affairs.permission.C2D_MESSAGE": 30, "android.permission.NETWORK_STATE": 615, "com.lalafo.permission.C2D_MESSAGE": 8478, "cz.mobilesoft.callblock.permission.C2D_MESSAGE": 14347, "hero.browser4g.internet.permission.C2D_MESSAGE": 15018, "nu.device.id.permission.C2D_MESSAGE": 16179, "hr.apps.n206958722.permission.C2D_MESSAGE": 15055, "com.superdevnl.busyboxchecker.permission.C2D_MESSAGE": 12499, "com.pockybop.sociali.permission.C2D_MESSAGE": 10967, "com.thunderst.launcher.permission.READ_SETTINGS": 12929, "com.userstorylab.onefifty.gcm.permission.C2D_MESSAGE": 13370, "de.rtl.video.permission.C2D_MESSAGE": 14510, "com.anuntis.fotocasa.permission.C2D_MESSAGE": 2586, "com.app.android.permission.C2D_MESSAGE": 2631, "com.cztraffic.activity.permission.JPUSH_MESSAGE": 4682, "com.bigleapstudios.bigmall.permission.C2D_MESSAGE": 3630, "com.yesup.mobiproxy.permission.C2D_MESSAGE": 14104, "com.duosecurity.duomobile.permission.C2D_MESSAGE": 5179, "com.widdit.lockScreen.permission.C2D_MESSAGE": 13875, "com.bamnetworks.mobile.android.ballpark.permission.C2D_MESSAGE": 3402, "com.mobincube.android.sc_3AFXSF.permission.C2D_MESSAGE": 9457, "com.tani.eren1.permission.C2D_MESSAGE": 12601, "com.ivms.hw.HD.permission.C2D_MESSAGE": 7871, "com.quizup.core.google.gcm.permission.C2D_MESSAGE": 11201, "com.jerichogames.hidden.permission.C2D_MESSAGE": 7950, "com.codetree.rmc.permission.C2D_MESSAGE": 4329, "de.aldiNord.android.permission.C2D_MESSAGE": 14388, "re.touchwa.navimeteo.permission.C2D_MESSAGE": 16517, "com.b2w.americanas.permission.C2D_MESSAGE": 3328, "net.casinuevo.appweb.permission.C2D_MESSAGE": 15939, "com.shop.android.permission.C2D_MESSAGE": 11949, "android.permission.Internet": 557, "com.zynga.cityvillemobile.permission.C2D_MESSAGE": 14299, "com.playtika.dice.legends.permission.C2D_MESSAGE": 10914, "fr.nghs.android.miser.permission.C2D_MESSAGE": 14779, "bbc.mobile.news.ww.permission.C2D_MESSAGE": 1218, "com.qiuandei.babytips.permission.token_content_provider": 11146, "fp.adobe.mint_16_55_push.permission.C2D_MESSAGE": 14731, "ru.lextre.matissa.permission.C2D_MESSAGE": 16598, "com.taplane.triviaquiz.permission.C2D_MESSAGE": 12623, "com.kaskus.chat.permission.C2D_MESSAGE": 8168, "com.mxxcid.fun.sea.permission.C2D_MESSAGE": 9762, "com.groomefy.permission.C2D_MESSAGE": 6900, "net.elvista.kozel.permission.C2D_MESSAGE": 15969, "com.androidapptech.passwordmanager.permission.C2D_MESSAGE": 2499, "com.whatsapp.permission.VOIP_CALL": 13853, "com.app_communicationconnection.layout.permission.C2D_MESSAGE": 2774, "com.sgn.geniesandgems.gp.permission.C2D_MESSAGE": 11901, "com.sharpshark.ageofwar.permission.C2D_MESSAGE": 11917, "com.thomsonreuters.convene.knox.permission.C2D_MESSAGE": 12919, "de.crea.musikparkdresden.permission.C2D_MESSAGE": 14419, "de.is24.android.permission.C2D_MESSAGE": 14456, "com.mathrawk.calleridfaker.permission.C2D_MESSAGE": 8989, "com.citrix.iflag.permission.C2D_MESSAGE": 4218, "com.emediashopgr.androidstore.permission.C2D_MESSAGE": 5343, "br.com.dafiti.permission.A4S_SEND": 1366, "com.goldengekko.edsa.herold.permission.C2D_MESSAGE": 6543, "com.mobisystems.msdict.embedded.wireless.oxford.concisemedical.permission.C2D_MESSAGE": 9546, "com.ads.asiandatingsocial.permission.C2D_MESSAGE": 2063, "ghost.hack.mod.for.minecraft.pe.emobileapp.permission.C2D_MESSAGE": 14957, "com.freeforallsoft.javavideotutorials.permission.C2D_MESSAGE": 5956, "com.xlr.bukd.permission.C2D_MESSAGE": 14056, "hr.apps.n150274672.permission.C2D_MESSAGE": 15047, "com.bonfiremedia.launcher.permission.C2D_MESSAGE": 3799, "com.applicando.applicandofood.permission.C2D_MESSAGE": 2919, "com.NNGames.sultan.permission.C2D_MESSAGE": 1849, "air.com.sgn.cookiejam.gp.permission.C2D_MESSAGE": 167, "com.India.Independencedaylivewallpaper.permission.C2D_MESSAGE": 1810, "br.com.claroespanhol.permission.BIND_SYNC_SERVICE": 1360, "com.esealed.dalily.permission.C2D_MESSAGE": 5414, "air.com.hoiquan52.choibaionline.permission.C2D_MESSAGE": 128, "com.jappka.bataria.permission.C2D_MESSAGE": 7909, "vn.harrisaustin.DotBattle.permission.C2D_MESSAGE": 17002, "de.bayernwerk_natur.impulskw.permission.C2D_MESSAGE": 14407, "com.nerdyoctopus.gamedots.permission.C2D_MESSAGE": 9985, "com.akashinfotech.mypcclub.permission.C2D_MESSAGE": 2182, "com.cars.quickoffers.dealers.permission.MAPS_RECEIVE": 4013, "com.aladinfun.crazyplanets.permission.C2D_MESSAGE": 2188, "com.ice9apps.robistorelocator.permission.C2D_MESSAGE": 7517, "uk.co.very.myvery.permission.RECEIVE_ADM_MESSAGE": 16934, "com.apps.adrcotfas.goodtime.permission.C2D_MESSAGE": 2959, "com.papumba.android.learnenglish.permission.C2D_MESSAGE": 10661, "com.com2us.smon.normal.freefull.google.kr.android.common.permission.C2D_MESSAGE": 4360, "nz.co.vodafone.android.myaccount.permission.C2D_MESSAGE": 16185, "com.diarioas.guialigas.permission.UA_DATA": 4893, "com.aniways.anigram.messenger.permission.C2D_MESSAGE": 2560, "com.Dean.launcher.permission.READ_SETTINGS": 1759, "com.amazon.android.permission.DOWNLOAD_WITHOUT_NOTIFICATION": 2276, "com.jrustonapps.myauroraforecast.permission.C2D_MESSAGE": 8061, "com.bitstrips.imoji.permission.C2D_MESSAGE": 3686, "com.fsecure.ms.dc.browser.permission.WRITE_HISTORY_BOOKMARKS": 6011, "com.huawei.android.internal.app.permission.WRITE_SETTINGS": 7395, "com.wq.stone.permission.JPUSH_MESSAGE": 13954, "com.aufeminin.beautiful.permission.MAPS_RECEIVE": 3222, "com.worldarcades.checkersbattler.permission.C2D_MESSAGE": 13948, "com.nokia.homescreen.permission.FASTLANE": 10219, "com.pft.starsports.ui.permission.UA_DATA": 10763, "com.firstdate.shadikiraat.permission.C2D_MESSAGE": 5745, "com.moonraft.tvsbuddy.locate.permission.MAPS_RECEIVE": 9627, "in.encashea.encasheaapp.permission.C2D_MESSAGE": 15164, "com.andysi.freevideochatonline.permission.C2D_MESSAGE": 2528, "com.devgame.fixiesfactory.permission.C2D_MESSAGE": 4840, "com.ea.fifaultimate_na.permission.C2D_MESSAGE": 5202, "android.permission.REMOVE_PACKAGES": 738, "com.gameonline.billiardtourpro.permission.C2D_MESSAGE": 6235, "com.omarapps.gardenswallpapers.permission.C2D_MESSAGE": 10420, "com.lookout.enterprise.permission.C2D_MESSAGE": 8748, "com.enrasoft.keepcalm.permission.C2D_MESSAGE": 5371, "com.ifeng.news2.permission.MMOAUTH_CALLBACK": 7556, "br.com.hotelurbano.permission.C2D_MESSAGE": 1377, "com.rfi.sams.android.permission.UA_DATA": 11403, "com.projectslender.permission.C2D_MESSAGE": 11065, "com.acmhacettepe.permission.C2D_MESSAGE": 2013, "com.money.cashapp.permission.C2D_MESSAGE": 9611, "com.wJuegodeBurbujasMariposas5.permission.C2D_MESSAGE": 13689, "mathrubhumi.calendar2017.permission.C2D_MESSAGE": 15671, "com.yoka.hotman.permission.JPUSH_MESSAGE": 14122, "com.dbd.pdfcreator.permission.C2D_MESSAGE": 4746, "com.guobi.winguo.hybrid.permission.READ_SETTINGS": 6957, "uk.co.volkswagen.myvw.permission.RECEIVE_ADM_MESSAGE": 16937, "com.zappoint.zappoint.permission.CORRECTION": 14178, "my.com.maxis.hotlink.permission.C2D_MESSAGE": 15894, "com.amazon.cast.mega.permission.C2D_MESSAGE": 2281, "mobi.infolife.ezweather.widget.albatross.permission.C2D_MESSAGE": 15776, "com.samsung.android.hostmanager.permission.READ_APP_REGISTRY": 11583, "am.ggtaxi.main.permission.MAPS_RECEIVE": 250, "com.hasbro.catchphrase.app.permission.C2D_MESSAGE": 7051, "com.searchonepeople.permission.C2D_MESSAGE": 11731, "com.fourtaps.libpro.permission.C2D_MESSAGE": 5906, "com.amazon.appmanager.preload.permission.READ_PRELOAD_APP_INFO_PROVIDER": 2278, "com.fakegps.location.go.permission.C2D_MESSAGE": 5634, "com.mocion.alistacar.permission.PushHandlerActivity": 9578, "com.google.android.c2dm.permission.REGISTRATION": 6653, "com.cometdocs.pdftoexcel.permission.C2D_MESSAGE": 4365, "com.mona.bettingtipsgr.permission.C2D_MESSAGE": 9608, "com.innospark.lgherosky.permission.C2D_MESSAGE": 7698, "com.fexyapps.quranmp3.permission.C2D_MESSAGE": 5707, "com.bluebyteapps.sporttips.permission.C2D_MESSAGE": 3767, "com.srs.shareaflash.permission.C2D_MESSAGE": 12378, "com.keerby.downloadaccelerator.permission.C2D_MESSAGE": 8219, "com.tinjasoft.tasks.permission.READ_TASKS": 12977, "com.studio8fa.adsense.permission.C2D_MESSAGE": 12452, "com.airasia.mobile.gcm.permission.C2D_MESSAGE": 2125, "com.narvii.amino.x99817505.permission.C2D_MESSAGE": 9905, "com.narvii.amino.x138543080.permission.C2D_MESSAGE": 9885, "mobi.mgeek.TunnyBrowser.permission.C2D_MESSAGE": 15820, "com.efamilynet.chat.permission.C2D_MESSAGE": 5286, "com.hill.socialliker.permission.C2D_MESSAGE": 7155, "kb2.soft.fuelmanager.permission.C2D_MESSAGE": 15499, "com.kartel.chargerpay.permission.C2D_MESSAGE": 8166, "com.appasia.theamazingwheel.permission.C2D_MESSAGE": 2882, "com.storm8studios.citynext.permission.C2D_MESSAGE": 12426, "htc.socialmanager.permission.USE_SOCIALSERVICE": 15072, "com.amazon.reinvent.permission.RECEIVE_ADM_MESSAGE": 2317, "android.permission.ACCESS_COURSE_LOCATION": 315, "networld.jetso.app.permission.C2D_MESSAGE": 16128, "com.airjordannikerelease.permission.C2D_MESSAGE": 2140, "madagascar.circus.permission.C2D_MESSAGE": 15657, "com.degrees.amtekaboma.r6.permission.C2D_MESSAGE": 4772, "empowr.android.permission.C2D_MESSAGE": 14618, "com.digitalturbine.iqsearch.push.permission.C2D_MESSAGE": 4920, "cineplaza_159.permission.C2D_MESSAGE": 1613, "com.girnarsoft.bikedekho.permission.C2D_MESSAGE": 6413, "com.hugogames.hugotrollrace.permission.C2D_MESSAGE": 7450, "com.IguazuGames.Puzzle.permission.C2D_MESSAGE": 1807, "com.paperlit.android.operanews.permission.C2D_MESSAGE": 10658, "com.foranj.farmtown2.permission.RECEIVE": 5873, "com.wBubbleBalloonShooter.permission.C2D_MESSAGE": 13615, "woden.combate.permission.C2D_MESSAGE": 17046, "com.conduit.app_61e53d3d43284f8ab76a83bdacf2d187.app.permission.MAPS_RECEIVE": 4439, "android.permission.STATUS_BAR": 801, "com.adotis.packking.permission.C2D_MESSAGE": 2060, "com.conduit.app_9b66f563bc1f4f38b2e2307f32166803.app.permission.MAPS_RECEIVE": 4479, "com.idl.giftcloud.permission.C2D_MESSAGE": 7545, "gli.gameramadhan.lawansetan.permission.C2D_MESSAGE": 14965, "com.huawei.camera.permission.BACKUP_PROVIDER": 7413, "it.panini.panadit.permission.C2D_MESSAGE": 15299, "com.surasak.arabickeyboardfreedownload131503.permission.C2D_MESSAGE": 12518, "net.fichajes.mobile.permission.C2D_MESSAGE": 15974, "com.khaleef.CricWick.permission.C2D_MESSAGE": 8246, "com.mylikes.likes.permission.C2D_MESSAGE": 9798, "com.first75.checkers2.permission.C2D_MESSAGE": 5743, "com.mingle.DanceBattle.permission.C2D_MESSAGE": 9252, "com.yulong3.android.launcher.permission.WRITE_SETTINGS": 14160, "com.sec.spp.permission.PUSH_SERVICE_PROVIDER": 11827, "vn.danhbai.tienlenvietnam.permission.C2D_MESSAGE": 16991, "org.x90live.mu.permission.C2D_MESSAGE": 16353, "pl.wyborcza.android.google.permission.C2D_MESSAGE": 16456, "com.sembozdemir.renstagram.permission.C2D_MESSAGE": 11853, "com.devzapps.fastbook.permission.C2D_MESSAGE": 4850, "com.huawei.android.internal.app.permission.READ_SETTINGS": 7394, "com.pulselive.bcci.android.permission.C2D_MESSAGE": 11089, "com.prime31.Etcetera.permission.C2D_MESSAGE": 11030, "org.vadel.mangawatchman.full.permission.C2D_MESSAGE": 16336, "curso.electricidad.permission.C2D_MESSAGE": 14339, "ch.denner.permission.C2D_MESSAGE": 1575, "com.huawei.launcher2.permission.READ_SETTINGS": 7427, "mobi.infolife.ezweather.widget.allo.permission.C2D_MESSAGE": 15778, "com.narvii.amino.x250794481.permission.C2D_MESSAGE": 9895, "com.corinthian.thirteencoins.permission.RECEIVE_ADM_MESSAGE": 4553, "com.deliveryclub.permission.C2D_MESSAGE": 4786, "com.bonial.kaufda.permission.C2D_MESSAGE": 3804, "pl.nubsoft.carpatrol.permission.C2D_MESSAGE": 16435, "asus.permission.INTERACT_ACROSS_USERS": 1103, "com.corprewardz.permission.C2D_MESSAGE": 4562, "com.becoquin.permission.C2D_MESSAGE": 3491, "com.resilio.sync.permission.C2D_MESSAGE": 11377, "com.disney.frozenletitroll_goo.permission.C2D_MESSAGE": 4952, "com.evogames.trump.permission.C2D_MESSAGE": 5512, "com.garena.game.kgtw.permission.C2D_MESSAGE": 6300, "com.gameindy.dummyth.permission.C2D_MESSAGE": 6213, "org.francais.irremote.permission.C2D_MESSAGE": 16257, "com.dodock.footylight.android.permission.C2D_MESSAGE": 5017, "com.wExecutiveRomance.permission.C2D_MESSAGE": 13657, "com.callscreen.hd.themes.permission.C2D_MESSAGE": 3969, "com.ril.ajio.permission.C2D_MESSAGE": 11418, "com.ztemt.launcher.permission.WRITE_SETTINGS": 14272, "www.platformstory.com.me.pokepia.permission.C2D_MESSAGE": 17074, "com.spn.panclinic.permission.MAPS_RECEIVE": 12342, "com.htc.sense.browser.permission.INITIALIZE_DATABASE": 7358, "com.developandroid.android.cars.permission.C2D_MESSAGE": 4833, "com.rgo47.app.permission.C2D_MESSAGE": 11405, "com.jovago.asia.android.permission.C2D_MESSAGE": 8041, "com.lenskart.app.permission.C2D_MESSAGE": 8538, "com.daraz.android.permission.C2D_MESSAGE": 4716, "com.newtreasure.gaple.test.android.permission.C2D_MESSAGE": 10072, "com.greengold.satish.piano.permission.C2D_MESSAGE": 6875, "flyjam.InstantTraductorLight.permission.C2D_MESSAGE": 14710, "com.inditex.ecommerce.bershka.permission.C2D_MESSAGE": 7659, "vuachoibai.vuabai.gamebai.permission.C2D_MESSAGE": 17027, "com.engie.permission.C2D_MESSAGE": 5365, "android.permission.CAMER": 439, "sands.mapCoordinates.android.permission.C2D_MESSAGE": 16654, "com.online.shopping.newvks.permission.C2D_MESSAGE": 10470, "com.mozillaonline.meituxiuxiu.permission.SEND_DOWNLOAD_COMPLETED_INTENTS": 9668, "nl.hbo.hbogo.permission.C2D_MESSAGE": 16155, "com.mountain.tracks.permission.C2D_MESSAGE": 9657, "com.alibaba.android.rimet.permission.MIPUSH_RECEIVE": 2213, "com.twitter.flight2015.permission.C2D_MESSAGE": 13247, "com.amazon.mShop.android.permission.MAPS_RECEIVE": 2304, "de.sport1.bulimanager.permission.C2D_MESSAGE": 14519, "com.holosfind.showroom.permission.C2D_MESSAGE": 7204, "android.permission.GET_TASK": 528, "com.fanduel.nbaturbo.permission.C2D_MESSAGE": 5645, "com.rfvijn.Android_GF_CoinNL_Rolling.permission.C2D_MESSAGE": 11404, "br.com.tapps.sharkevolution.permission.C2D_MESSAGE": 1454, "com.moovechat.permission.C2D_MESSAGE": 9631, "com.jumia.house.android.permission.A4S_SEND": 8086, "com.thenigo.bimsalabim.permission.C2D_MESSAGE": 12904, "org.worona.android.worona_blog.permission.C2D_MESSAGE": 16345, "com.idlegames.eldorado.permission.C2D_MESSAGE": 7546, "com.meetup.permission.MAPS_RECEIVE": 9095, "de.cellular.galileo.permission.C2D_MESSAGE": 14415, "com.itxavor.allsimpackages.permission.C2D_MESSAGE": 7865, "net.one97.paytm.permission.UA_DATA": 16078, "com.cupidly.hookup.permission.C2D_MESSAGE": 4640, "com.whaleshark.retailmenot.permission.RECEIVE_ADM_MESSAGE": 13848, "com.go.abclocal.ktrk.android.weather.permission.C2D_MESSAGE": 6503, "ru.litres.android.flybook.permission.C2D_MESSAGE": 16600, "com.mobirate.planeinsane.gplay.permission.C2D_MESSAGE": 9522, "com.arshad.map.permission.MAPS_RECEIVE": 3110, "com.wleforumducampingcar3.permission.C2D_MESSAGE": 13918, "sts.al.permission.C2D_MESSAGE": 16780, "com.nfl.fantasy.core.android.permission.C2D_MESSAGE": 10103, "com.samsung.android.providers.context.permission.WRITE_RECORD_AUDIO": 11593, "com.kdanmobile.android.pdfreader.google.pad.permission.C2D_MESSAGE": 8201, "com.tedrasoft.citiesquiz.permission.C2D_MESSAGE": 12717, "com.msi.icongame.permission.C2D_MESSAGE": 9695, "com.ttech.android.onlineislem.permission.C2D_MESSAGE": 13209, "ru.gmsoft.magazines.megamozg.permission.C2D_MESSAGE": 16586, "de.affinitas.za.co.elitesingles.and.permission.C2D_MESSAGE": 14387, "br.com.primelan.primespotarena.permission.C2D_MESSAGE": 1413, "com.wEdgeforAndroid.permission.C2D_MESSAGE": 13649, "me.whitebeard.jamaloukimobile.permission.C2D_MESSAGE": 15714, "android.permission.MANAGE_SOUND_TRIGGER": 576, "rierie.media.audiorecorder.permission.C2D_MESSAGE": 16533, "com.gpshopper.adidas.permission.C2D_MESSAGE": 6829, "com.jagplay.client.android.app.jagchess.permission.C2D_MESSAGE": 7897, "com.wGeckoBrowserforAndroid.permission.C2D_MESSAGE": 13673, "se.feomedia.quizkampen.no.lite.permission.C2D_MESSAGE": 16678, "com.android.broswer.permission.WRITE_HISTORY_BOOKMARKS": 2381, "com.ms.coupleobserver.permission.C2D_MESSAGE": 9686, "com.myxl.prepaid.permission.C2D_MESSAGE": 9845, "salon.look.ui.permission.C2D_MESSAGE": 16647, "com.fitivity.basketball_shooting.permission.C2D_MESSAGE": 5758, "com.viettel.vpmt.mobiletv.permission.C2D_MESSAGE": 13455, "com.claroColombia.contenedor.permission.UA_DATA": 4245, "com.jio.media.mobile.apps.jiobeats.permission.C2D_MESSAGE": 7986, "air.FingerVsAxesAndroid.permission.C2D_MESSAGE": 53, "air.timuzsolutions.monsterridehdpro.permission.C2D_MESSAGE": 231, "com.dubizzle.horizontal.permission.MAPS_RECEIVE": 5156, "com.embrace_2redbeans.permission.C2D_MESSAGE": 5338, "android.permission.READ_CONTACTS": 662, "com.wCMSHelmets.permission.C2D_MESSAGE": 13621, "com.arabeyes.wallpaper.permission.C2D_MESSAGE": 3070, "com.olr.rechargeitnow.permission.C2D_MESSAGE": 10385, "com.manash.purplle.permission.C2D_MESSAGE": 8906, "com.boyaa.dummy.permission.C2D_MESSAGE": 3836, "com.freedompop.ott.permission.READ_DATABASE": 5950, "com.kt.android.showtouch.permission.MAPS_RECEIVE": 8417, "com.com2us.soulcollector.normal.freefull.google.global.android.common.permission.C2D_MESSAGE": 4361, "com.5see.android.permissions.READ_LOCAL_DB": 1702, "com.trtf.blue.permission.ACCESS_PROVIDER": 13177, "com.cbsnews.sixtyminutes.permission.C2D_MESSAGE": 4054, "com.cendana2000.serbabayarmobile.permission.C2D_MESSAGE": 4076, "com.meteoplaza.flash.permission.C2D_MESSAGE": 9156, "android.permission.READ_MMS": 682, "uae.gies.permission.C2D_MESSAGE": 16919, "com.fancykey.emoji.keyboard.indic.permission.C2D_MESSAGE": 5642, "com.iop.conference2016.permission.MAPS_RECEIVE": 7785, "com.alpha.teamworks.simple_fb_downloader.permission.C2D_MESSAGE": 2258, "media.media1e1a.arkadaslik.permission.C2D_MESSAGE": 15722, "ws.e2m.sp.permission.C2D_MESSAGE": 17063, "com.pikpok.fl.play.permission.C2D_MESSAGE": 10806, "com.ubl.spellmaster.permission.C2D_MESSAGE": 13274, "com.lge.launcher.permission.WRITE_SETTINGS": 8570, "at.com.media.markt.permission.UA_DATA": 1117, "com.mob1st.vtex.ladyhairpro.permission.C2D_MESSAGE": 9331, "com.mobapphome.millionaire.tr.permission.C2D_MESSAGE": 9346, "com.mtnmusicplus.akazoo.permission.C2D_MESSAGE": 9710, "com.j2.efax.gcm.permission.C2D_MESSAGE": 7888, "com.riatech.instarepost.permission.C2D_MESSAGE": 11411, "com.nextgenreality.wrt.permission.C2D_MESSAGE": 10092, "com.asos.app.permission.PUSHIO_MESSAGE": 3149, "com.iarts.barbeariabompastor.permission.C2D_MESSAGE": 7492, "com.karmangames.euchre.permission.C2D_MESSAGE": 8164, "com.aircel.retailer.permission.C2D_MESSAGE": 2136, "com.siramdev.whatssapp.videocall.permission.C2D_MESSAGE": 12021, "com.norms.kids.basic.learn.permission.C2D_MESSAGE": 10237, "com.jb.gosms.permission.C2D_MESSAGE": 7929, "net.hideman.free.permission.C2D_MESSAGE": 16012, "com.erepubliklabs.cland.permission.C2D_MESSAGE": 5401, "com.kets1r1recoverformattedsdcardguide.permission.C2D_MESSAGE": 8231, "apps.market.yung.funk.permission.C2D_MESSAGE": 1063, "com.fsecure.ms.safe.browser.permission.WRITE_HISTORY_BOOKMARKS": 6017, "com.allianz.rsa.nl.bosch.gcm.permission.C2D_MESSAGE": 2237, "com.gamevilusa.dungeonlink.android.google.global.normal.permission.C2D_MESSAGE": 6276, "com.carrefour.android.app.ooshop.permission.A4S_SEND": 4004, "com.google.android.googlequicksearchbox.permission.C2D_MESSAGE": 6757, "com.xanh9.danhbai.permission.C2D_MESSAGE": 13991, "com.mominis.permission.preferences.provider.READ_WRITE": 9606, "com.backflipstudios.android.dragonvale.permission.C2D_MESSAGE": 3341, "com.gpshopper.bestbuygamers.android.permission.MAPS_RECEIVE": 6833, "com.mobilesrepublic.appygamer.permission.BIND_SERVICE": 9416, "com.autocop.pro.gcm.permission.C2D_MESSAGE": 3238, "free.find.difference13.permission.C2D_MESSAGE": 14812, "com.mobincube.countrysidesinglescom.permission.C2D_MESSAGE": 9490, "com.app.lasvegasbikefest.permission.C2D_MESSAGE": 2682, "com.samsung.android.email.permission.READ_ATTACHMENT": 11577, "com.tangoapp.permission.C2D_MESSAGE": 12598, "com.htc.home.personalize.permission.WRITE_SCENES": 7317, "com.conduit.app_27a1b4029e8e4869a722f8c409abd4cb.app.permission.C2D_MESSAGE": 4417, "jp.hiraky.furimaalert.permission.C2D_MESSAGE": 15426, "com.flyersoft.moonreader.permission.C2D_MESSAGE": 5831, "com.sarmady.filgoal.permission.C2D_MESSAGE": 11661, "com.xn.xiaoyan.permission.JPUSH_MESSAGE": 14058, "tw.com.aktsk.cineleven.permission.C2D_MESSAGE": 16894, "com.app.suncoastcanaryandfinchclub.permission.C2D_MESSAGE": 2730, "android.webkit.permission.PLUGIN": 992, "gr.vanderbox.lola.permission.C2D_MESSAGE": 14988, "com.cupidmedia.wrapper.blackcupid.permission.C2D_MESSAGE": 4641, "eu.livesport.Eredmenyek_com.permission.C2D_MESSAGE": 14671, "com.seynse.cardigone.permission.C2D_MESSAGE": 11881, "fr.festivaldecannes.permission.C2D_MESSAGE": 14748, "com.landmarkgroup.landmarkshops.permission.MAPS_RECEIVE": 8486, "tw.appmakertw.com.a347.permission.C2D_MESSAGE": 16891, "com.go.abclocal.wpvi.android.weather.permission.C2D_MESSAGE": 6505, "com.google.android.googleapps.permission.GOOGLE_AUTH.adsense": 6719, "com.anchorfree.kaboom.permission.C2D_MESSAGE": 2348, "com.playfirst.playground.hoteldash.permission.RECEIVE_ADM_MESSAGE": 10883, "android.permission.READ_EXTERNAL_STORAGE": 665, "minskguide.org.permission.C2D_MESSAGE": 15737, "com.msfeedback.activity.permission.C2D_MESSAGE": 9691, "com.aaagame.aaacasino.permission.C2D_MESSAGE": 1941, "mindware.mindgames.permission.C2D_MESSAGE": 15732, "com.microsoft.ignite.permission.C2D_MESSAGE": 9203, "com.worldventures.dreamtrips.permission.C2D_MESSAGE": 13951, "com.qreventos.tecnofidta.permission.C2D_MESSAGE": 11167, "com.chatgum.chat.rooms.permission.C2D_MESSAGE": 4107, "com.flyperinc.flychat.permission.C2D_MESSAGE": 5839, "com.vuabai.permission.C2D_MESSAGE": 13580, "com.fsecure.ultralight.permission.READ": 6025, "com.gp.CaptchaEntry.permission.C2D_MESSAGE": 6825, "com.app_beachhousehd.layout.permission.C2D_MESSAGE": 2753, "com.getanightlife.venueapp.gbt.permission.C2D_MESSAGE": 6364, "net.daum.android.solcalendar.permission.C2D_MESSAGE": 15959, "com.mobincube.android.sc_35AFEA.permission.C2D_MESSAGE": 9449, "com.wonderplanet.CrashFever.permission.C2D_MESSAGE": 13935, "com.mob1st.vtex.femalepet.permission.C2D_MESSAGE": 9330, "com.xenon.cartisan.customer.permission.C2D_MESSAGE": 14005, "com.conduit.app_65e625e89479481ca3dd11d32aba3f7c.app.permission.MAPS_RECEIVE": 4445, "kr.bananasoft.girlfriendsnine.permission.C2D_MESSAGE": 15542, "com.ludia.fgx.permission.C2D_MESSAGE": 8799, "com.AdofGames.BattleOfDots.permission.C2D_MESSAGE": 1713, "com.securevpn.securevpn.permission.C2D_MESSAGE": 11840, "com.forsale.forsale.permission.C2D_MESSAGE": 5882, "io.moj.mobile.android.caralarm.permission.C2D_MESSAGE": 15251, "me.nextdoors.WK.permission.C2D_MESSAGE": 15697, "com.tv.audition.auditiontv.permission.C2D_MESSAGE": 13238, "com.maret.maps.permission.MAPS_RECEIVE": 8951, "jp.gmomedia.android.freeml.permission.C2D_MESSAGE": 15422, "com.ubisoft.strategy.annobae.permission.C2D_MESSAGE": 13272, "com.auto_jem.DaDaedu.permission.C2D_MESSAGE": 3233, "getui.permission.GetuiService.com.lesports.glivesports": 14904, "com.dreamweaverlabs.greenacres.permission.C2D_MESSAGE": 5114, "com.aitype.android.lang.fa.permission.C2D_MESSAGE": 2161, "com.easilydo.edge.permission.C2D_MESSAGE": 5229, "com.gn.android.compass.permission.C2D_MESSAGE": 6495, "com.games2win.highschooldt.permission.C2D_MESSAGE": 6243, "com.girnarsoft.dealer.cargomotors.permission.C2D_MESSAGE": 6420, "com.airbnb.android.permission.JPUSH_MESSAGE": 2130, "com.amdroidalarmclock.amdroid.permission.MAPS_RECEIVE": 2332, "com.htc.android.mail.permission.WRITE_ACCOUNT": 7283, "jp.co.bbb.ariatheavvenire.permission.C2D_MESSAGE": 15369, "com.mju.newzgram.permission.C2D_MESSAGE": 9301, "com.borjaklyawm.news.permission.C2D_MESSAGE": 3818, "sda.melissa.ai.permission.C2D_MESSAGE": 16662, "com.fabulyst.mobile.permission.C2D_MESSAGE": 5591, "com.iliberi.aplicariumqr.permission.MAPS_RECEIVE": 7612, "com.dada.video.app.permission.C2D_MESSAGE": 4683, "com.argames.doors.permission.C2D_MESSAGE": 3090, "com.qq.AppService.permission.out.CACHE_WRITE_PERMISSION": 11157, "com.sfr.android.redmoncompte.permission.C2D_MESSAGE": 11886, "com.good.gcs.permission.CONTENT_READ": 6563, "cn.eclicks.drivingtest.permission.MIPUSH_RECEIVE": 1633, "com.wLiveDarshanSaiBaba.permission.C2D_MESSAGE": 13696, "com.dialog.aptv.permission.C2D_MESSAGE": 4880, "com.tippingcanoe.holidaypirates.permission.RECEIVE_ADM_MESSAGE": 12995, "com.chic.uvlight.permission.C2D_MESSAGE": 4162, "com.android.voicemail.permission.READ_VOICEMAIL": 2489, "com.ubisoft.owlient.howrse.permission.C2D_MESSAGE": 13270, "android.permission.writeSET_TIME_ZONE": 983, "br.com.r7developers.eraslot.permission.C2D_MESSAGE": 1414, "com.gameloft.android.ANMP.GloftPDHM.permission.C2D_MESSAGE": 6230, "com.onedial.social.permission.C2D_MESSAGE": 10433, "in.encashea.encasheaapp.permission.MAPS_RECEIVE": 15165, "com.ipmagix.rixosevent.permission.C2D_MESSAGE": 7801, "com.careapplication.permission.MAPS_RECEIVE": 3993, "com.htc.permission.APP_DEFAULT": 7341, "com.googleapps.org.permission.C2D_MESSAGE": 6801, "com.seatgeek.android.permission.C2D_MESSAGE": 11742, "com.linio.android.permission.C2D_MESSAGE": 8653, "com.ideacellular.digitalvideo.permission.ACCESS_DOWNLOAD_MANAGER": 7537, "com.polarnoid.getgiftz.permission.C2D_MESSAGE": 10985, "com.fungenerationlab.mxr3.permission.C2D_MESSAGE": 6083, "xyz.ioob.ld.permission.C2D_MESSAGE": 17093, "all.in.one.calculator.permission.C2D_MESSAGE": 241, "com.gawent.carofdistance.app.permission.JPUSH_MESSAGE": 6316, "com.sap.sapapp.permission.MAPS_RECEIVE": 11651, "com.max.futwager.permission.C2D_MESSAGE": 9001, "animation_944.permission.C2D_MESSAGE": 997, "com.lguplus.homeiot.permission.C2D_MESSAGE": 8579, "com.ldtxapp.ldtx.permission.MIPUSH_RECEIVE": 8515, "com.kongregate.mobile.battlehand.google.permission.C2D_MESSAGE": 8373, "jp.naver.lineantivirus.android.permission.SMISHING_ALERT": 15454, "com.ludia.dragons.permission.RECEIVE_ADM_MESSAGE": 8794, "com.tencent.legend.permission.C2D_MESSAGE": 12765, "com.iscoolentertainment.castlerun.permission.RECEIVE_ADM_MESSAGE": 7819, "com.clashofc.fhxclashofclans.permission.C2D_MESSAGE": 4246, "com.google.android.apps.enterprise.dmagent.permission.InvokeDMServicePermission": 6626, "com.cyntrxeld.permission.C2D_MESSAGE": 4671, "lagamerie.nope.permission.C2D_MESSAGE": 15598, "getui.permission.GetuiService.com.mp1.bbtk": 14915, "com.sec.android.permission.PERSONAL_MEDIA": 11788, "com.hotbuyone.us.permission.C2D_MESSAGE": 7233, "com.libii.candyfashion.permission.C2D_MESSAGE": 8586, "net.blocksandapp.crazycraft.permission.C2D_MESSAGE": 15932, "com.show.greenbill_G.permission.C2D_MESSAGE": 11975, "com.bluebyteapps.raatkatariqa.permission.C2D_MESSAGE": 3766, "com.libiitech.highschoolsalon.permission.C2D_MESSAGE": 8604, "com.octro.ludolive.permission.C2D_MESSAGE": 10352, "com.owlr.controller.foscam.permission.C2D_MESSAGE": 10602, "com.appgamestudio.games.restaurantquiz.permission.C2D_MESSAGE": 2904, "air.gamebaidoithuong.doithe.2016.permission.C2D_MESSAGE": 210, "com.cg.newyorkcitytowerbuilder.permission.C2D_MESSAGE": 4085, "com.animocabrands.google.eahTeaParty.permission.C2D_MESSAGE": 2555, "com.defacto.android.permission.C2D_MESSAGE": 4768, "jp.arismile.f23a255.permission.C2D_MESSAGE": 15361, "tw.bxb.eew.light.permission.C2D_MESSAGE": 16893, "com.joeware.android.gpulumera.permission.C2D_MESSAGE": 8017, "com.eldev.flygps.permission.C2D_MESSAGE": 5313, "com.appseleration.android.selfcare.permission.C2D_MESSAGE": 2979, "me.doubledutch.ggqbc.eonsupplierinnovation.permission.C2D_MESSAGE": 15692, "com.followmania.permission.C2D_MESSAGE": 5848, "com.beyondapp.permission.GETGAID": 3567, "com.dzs.xuhangeconomiczone.permission.JPUSH_MESSAGE": 5193, "net.corethree.metrobus.permission.MAPS_RECEIVE": 15949, "com.qvghnxp.electrohousemusic.permission.C2D_MESSAGE": 11217, "com.techpebbles.cn.permission.C2D_MESSAGE": 12699, "com.valiprod.actionouverite_hot.permission.C2D_MESSAGE": 13386, "com.conduit.app_c49e45ddaddd48b891ff4477e04771fd.app.permission.MAPS_RECEIVE": 4500, "ru.ykt.eda.permission.C2D_MESSAGE": 16641, "com.android_group.trivia_duel_quiz.permission.C2D_MESSAGE": 2493, "se.feomedia.quizkampen.id.lite.permission.C2D_MESSAGE": 16673, "com.baseproject.positiveapps.gcm.permission.C2D_MESSAGE": 3437, "com.google.android.c2dm.permission.C2D_MESSAGE": 6648, "com.joycrafter.worldwarfare.gp.permission.C2D_MESSAGE": 8050, "com.hearst.android.wcvb.permission.C2D_MESSAGE": 7089, "app.search.sogou.common.permission.ACCESS_DOWNLOAD_MANAGER_ADVANCED": 1049, "com.kakao.wheel.permission.C2D_MESSAGE": 8149, "com.fanzetech.tools.permission.C2D_MESSAGE": 5662, "com.rm.android.wcps.permission.C2D_MESSAGE": 11431, "littleblackbook.com.littleblackbook.lbbdapp.lbb.permission.MAPS_RECIEVE": 15618, "com.philips.moonshot.permission.C2D_MESSAGE": 10779, "com.google.android.apps.googlevoice.permission.AUTO_SEND": 6629, "com.klook.partner.gcm.permission.C2D_MESSAGE": 8342, "com.sina.permission.ACCESS_DOWNLOAD_MANAGER_ADVANCED": 12008, "com.sc.daraz.permission.A4S_SEND": 11686, "com.kikuu.permission.JPUSH_MESSAGE": 8267, "com.ijinshan.browser.permission.MIPUSH_RECEIVE": 7590, "com.supercleaner.permission.ANTI_VIRUS": 12497, "tr.com.media.markt.permission.RECEIVE_ADM_MESSAGE": 16851, "com.notissimus.oodji.Android.permission.C2D_MESSAGE": 10254, "com.uriosweb.appidays.rsvp.permission.C2D_MESSAGE": 13362, "com.decxzSoft.hairStyles.Hair.permission.C2D_MESSAGE": 4766, "com.isuog.conference2016.permission.C2D_MESSAGE": 7837, "com.visualdesign.livefootballontvlite.permission.RECEIVE_ADM_MESSAGE": 13480, "com.ayce.permission.C2D_MESSAGE": 3314, "com.joy.rewards.app.permission.C2D_MESSAGE": 8043, "com.kny.taiwanfreewaycamviewer.permission.C2D_MESSAGE": 8352, "com.mobime.ecooltra.permission.C2D_MESSAGE": 9432, "com.onesolutionapps.firstassuredbailbonds.permission.MAPS_RECEIVE": 10449, "ro.ascendnet.android.agregator.permission.C2D_MESSAGE": 16538, "com.att.android.digitallocker.sync.permission.READ_WRITE_PROVIDERS": 3201, "com.raindropstudio.programmingbasic.permission.C2D_MESSAGE": 11250, "htc.socialmanager.permission.READ_SOCIAL_DATABASE": 15069, "net.slickdeals.android.permission.C2D_MESSAGE": 16105, "com.nanuinteractive.permissions.MainActivity": 9878, "com.ar.augment.permission.C2D_MESSAGE": 3066, "air.com.mastertigra.vreale.permission.C2D_MESSAGE": 144, "net.phcorner.app.permission.C2D_MESSAGE": 16084, "com.appstore.arapps.permission.C2D_MESSAGE": 3022, "zerolab.android.pdown.permission.C2D_MESSAGE": 17114, "com.appxplore.caveboy.permission.C2D_MESSAGE": 3048, "com.doapps.android.mln.MLN_fd1a4a4346d5ba7464d64636d604925e.permission.C2D_MESSAGE": 5004, "com.olsera.olseramobile.budung.permission.C2D_MESSAGE": 10387, "com.qidian.QDReader.permission.WRITE_DB": 11118, "com.catdaddy.mynba2k17.permission.C2D_MESSAGE": 4043, "com.robotemplates.com.regimemiracle.androidapp.permission.C2D_MESSAGE": 11445, "net.daum.android.mail.permission.C2D_MESSAGE": 15958, "com.vodafone.mCare.permission.MAPS_RECEIVE": 13528, "au.com.cricket.permission.C2D_MESSAGE": 1148, "org.hicham.adhan_downloader.permission.C2D_MESSAGE": 16274, "android.permission.RECEIVE_BOOT_COMPLETE": 717, "com.natasa.dragoneggs.permission.C2D_MESSAGE": 9909, "enbd.gaming.banki.permission.C2D_MESSAGE": 14621, "com.amazon.mysampleapp.permission.C2D_MESSAGE": 2309, "com.danhbaidoithuong.gamebai.permission.C2D_MESSAGE": 4707, "com.fitpicapp.farmers_meet.permission.C2D_MESSAGE": 5764, "com.photovideo.hdvideoplayer.permission.C2D_MESSAGE": 10790, "com.mobogenie.permission.RECEIVE_BROADCAST": 9561, "com.bettingtipsapp.freebettingtips.permission.C2D_MESSAGE": 3565, "com.app_britishgp.layout.permission.C2D_MESSAGE": 2760, "com.Ocozzio.SIIA2015.permission.C2D_MESSAGE": 1858, "android.permission.record_audio": 941, "com.bingo.club.permission.RECEIVE_ADM_MESSAGE": 3653, "gr.blogspot.feasyapps.animalsforkids.permission.C2D_MESSAGE": 14981, "com.dbd.ghosttalk.permission.C2D_MESSAGE": 4745, "com.cricket.ksca.permission.C2D_MESSAGE": 4599, "com.amazon.now.permission.C2D_MESSAGE": 2310, "gov.fema.mobile.android.permission.PushHandlerActivity": 14979, "com.gamebility.coloringbook.permission.C2D_MESSAGE": 6192, "com.aufeminin.beautiful.permission.C2D_MESSAGE": 3221, "com.kraftly.app.permission.LAYER_PUSH": 8400, "com.htc.launcher.permission.SETUP_HOME_LAYOUT": 7331, "cn.safetrip.edog.permission.JPUSH_MESSAGE": 1644, "com.businesslinktrading.makani.permission.C2D_MESSAGE": 3922, "com.appmahal.app.permission.C2D_MESSAGE": 2941, "com.yournet.asobo.browser.permission.C2D_MESSAGE": 14133, "com.pcbasictraining.z.vehicleledger.permission.C2D_MESSAGE": 10709, "br.com.rodrigokolb.realdrum.permission.C2D_MESSAGE": 1421, "com.hugogames.axeinface2.universal.permission.RECEIVE_ADM_MESSAGE": 7447, "qa.vodafone.myvodafone.permission.C2D_MESSAGE": 16504, "com.SarahAnderson.flirtforfemales.permission.C2D_MESSAGE": 1878, "com.umonistudio.tile.permission.C2D_MESSAGE": 13323, "com.app_ravfm.layout.permission.C2D_MESSAGE": 2844, "com.game.bai.tien.len.miennam.permission.C2D_MESSAGE": 6161, "de.bauerlive.presentmanager.permission.C2D_MESSAGE": 14402, "com.fitness.newwomenapp.permission.C2D_MESSAGE": 5763, "com.google.android.googleapps.permission.GOOGLE_AUTH.lh2": 6738, "android.permission.READ_LOGS": 680, "se.feomedia.quizkampen.base.permission.C2D_MESSAGE": 16667, "it.deeptelegram.messenger.permission.MAPS_RECEIVE": 15274, "com.aitype.smileyart.permission.C2D_MESSAGE": 2168, "com.guruinfomedia.memory.cache.permission.C2D_MESSAGE": 6963, "com.taptrip.permission.C2D_MESSAGE": 12632, "com.mob1st.vtex.revendedorthipos.permission.C2D_MESSAGE": 9332, "com.mobilegameart.fortunecookie.permission.C2D_MESSAGE": 9386, "com.shopback.app.permission.C2D_MESSAGE": 11952, "de.momox.permission.C2D_MESSAGE": 14490, "com.samsung.mdl.radio.permission.WRITE_RADIO_STORAGE": 11614, "com.fission.sevennujoom.permission.C2D_MESSAGE": 5755, "com.etsy.android.soe.permission.C2D_MESSAGE": 5469, "com.india.allinoneshopping.permission.C2D_MESSAGE": 7647, "com.pruebas.prueba.permission.C2D_MESSAGE": 11078, "net.mobigame.zombietsunami.permission.C2D_MESSAGE": 16059, "it.doveconviene.android.permission.C2D_MESSAGE": 15277, "com.astrotek.hp.pixicam.permission.C2D_MESSAGE": 3161, "android.permission.ACCESS_NETWORK_CONFIGURATION": 343, "com.renren.permission.ACCESS_DOWNLOAD_MANAGER": 11368, "com.zippyraft.millionaire.permission.C2D_MESSAGE": 14232, "com.kobobooks.android.orbile.permission.C2D_MESSAGE": 8356, "com.tionnet.getitstar.permission.C2D_MESSAGE": 12992, "com.google.maps.android.utils.permission.MAPS_RECEIVE": 6799, "com.bianor.ams.permission.C2D_MESSAGE": 3590, "com.android.setting.permission.ALLSHARE_CAST_SERVICE": 2471, "com.android.launcher.permission.UNINSTALL_SHORTCUT": 2417, "livestreet.mapview.map.permission.C2D_MESSAGE": 15620, "com.pinktwins.mesh.permission.C2D_MESSAGE": 10831, "com.mobincube.trucos_y_guia_para_pokemon_go_2016_en_espanol.permission.C2D_MESSAGE": 9511, "com.fluik.Explosions.permission.C2D_MESSAGE": 5826, "com.ujoy.sm.permission.C2D_MESSAGE": 13289, "net.giosis.shopping.hub.permission.C2D_MESSAGE": 15992, "com.app.latinotvlive.permission.C2D_MESSAGE": 2684, "com.galaxys.launcher.permission.READ_SETTINGS": 6153, "com.cf.flightsearch.permission.C2D_MESSAGE": 4082, "mobi.infolife.ezweather.widget.dawn.permission.C2D_MESSAGE": 15785, "com.chatous.chatous.permission.C2D_MESSAGE": 4108, "com.abercrombie.hollister.permission.RECEIVE_ADM_MESSAGE": 1970, "com.ushareit.listenit.permission.C2D_MESSAGE": 13372, "com.avis.androidapp.permission.C2D_MESSAGE": 3286, "com.duobao.oversea.permission.SEND_DOWNLOAD_COMPLETED_INTENTS": 5171, "studiomignot_22.permission.C2D_MESSAGE": 16785, "com.auscakstudio.runnersforbiddenforest.permission.C2D_MESSAGE": 3230, "com.kkmlauncher.permission.READ_SETTINGS": 8317, "ro.carzz.permission.C2D_MESSAGE": 16540, "com.mcc.gpstar.permission.C2D_MESSAGE": 9021, "com.amc.permission.MAPS_RECEIVE": 2326, "com.wiziapp.app_b23ab348a927a3799ad02dc3f4240c7a.permission.C2D_MESSAGE": 13910, "com.linecorp.LGSDG.permission.C2D_MESSAGE": 8641, "gt.com.tigo.nicetech.tigoone.permission.C2D_MESSAGE": 14992, 